{
    "title": "Addie's Puff Pastry Pizzas",
    "file_name": "addie's-puff-pastry-pizzas",
    "url": "https://www.allrecipes.com/recipe/268581/addies-puff-pastry-pizzas/",
    "cuisine": "Mexican",
    "difficulty": "Easy",
    "cooking_time": "25 minutes",
    "country": "Mexico",
    "continent": "North America",
    "metadata": {
        "prep_time": "25 mins",
        "cook_time": "30 mins",
        "total_time": "55 mins",
        "active_time": "Unknown",
        "servings": "12",
        "calories": "353 Calories"
    },
    "ingredients": [
        "1 ½ tablespoons butter",
        "1 tablespoon grated Parmesan cheese",
        "1 teaspoon garlic powder",
        "1 (17.5 ounce) package frozen puff pastry, thawed in the refrigerator",
        "1 (14 ounce) jar pasta sauce, or to taste",
        "1 (8 ounce) package shredded Italian cheese blend",
        "1 cup sliced fresh mushrooms (Optional)",
        "¼ cup crumbled cooked bacon, or to taste (Optional)"
    ],
    "method": [
        "Step 1: Preheat the oven to 425 degrees F (220 degrees C). Gather all of your ingredients and a cookie sheet; you'll have to work quickly once the puff pastry is out of the fridge.",
        "Step 2: Melt butter in a microwave-safe bowl; stir in Parmesan cheese and garlic powder.",
        "Step 3: Remove 1 sheet puff pastry from fridge. Keep the other sheet chilled. Very gently unfold the sheet onto your work surface. Press pastry back together if it cracks. Slice into 6 squares and place them 1 1/2 to 2 inches apart on the cookie sheet. Brush the edges of each square with some of the garlic butter. Add a spoonful of sauce to the center of each square. Top with some Italian cheese, mushrooms, and bacon.",
        "Step 4: Bake in the preheated oven until puffed and golden, about 15 minutes.",
        "Step 5: In the meantime, repeat slicing, brushing, and topping the second sheet of puff pastry. Bake second batch for 15 minutes.",
        "Step 6: Feel free to substitute the pasta sauce with 6 sliced plum tomatoes.",
        "Step 7: You can get creative with this recipe for appetizers. Cut the pastry into even smaller squares and top with Alfredo sauce and shrimp, or grilled chicken, Mexican cheese, and salsa. It's super easy and delicious."
    ],
    "image": "images/addie's-puff-pastry-pizzas.png"
}