{
    "title": "Argentinian Beef Empanadas",
    "file_name": "argentinian-beef-empanadas",
    "url": "https://www.allrecipes.com/recipe/244265/argentinian-beef-empanadas/",
    "cuisine": "Argentinian",
    "difficulty": "Medium",
    "cooking_time": "60 minutes",
    "country": "Argentina",
    "continent": "South America",
    "metadata": {
        "prep_time": "1 hr",
        "cook_time": "25 mins",
        "total_time": "1 hr 25 mins",
        "active_time": "Unknown",
        "servings": "8",
        "calories": "823 Calories"
    },
    "ingredients": [
        "½ pound ground beef",
        "3 tablespoons butter",
        "2 medium onions, chopped",
        "1  green onion, chopped",
        "2  hard-boiled eggs, chopped",
        "14  pitted green olives, such as Manzanilla, finely chopped",
        "3 tablespoons raisins",
        "1 teaspoon cumin",
        "½ teaspoon salt",
        "¼ teaspoon black pepper",
        "2 (17.5 ounce) packages frozen puff pastry (each with 2 sheets), thawed",
        "1  raw egg, lightly beaten"
    ],
    "method": [
        "Step 1: Preheat the oven to 450 degrees F (230 degrees C). Set racks in the upper and lower thirds of the oven and line 2 large baking sheets with parchment paper.",
        "Step 2: Cook beef in a large, heavy skillet over medium-high heat, stirring and breaking up lumps, until no longer pink, 4 to 5 minutes. Transfer beef to a small bowl with a slotted spoon, and pour off grease from the skillet. Melt butter in the skillet and saute onions and green onion, stirring occasionally, until tender, about 5 minutes. Return beef to skillet and stir in hard-boiled eggs, olives, raisins, cumin, salt, and pepper. Transfer mixture to a shallow bowl and chill until cooled, 10 to 20 minutes.",
        "Step 3: Unfold one pastry sheet, keeping remaining sheets chilled, onto a lightly floured surface, dust lightly with flour, and roll out into a 12-inch square. Cut four 5 1/2-inch rounds from pastry. Brush a 1/2-inch border around the edges of one round with water, using a small brush or fingertip. Spoon about 3 tablespoons of filling onto half of the round. Fold other half over filling and press edges together firmly. Crimp edges with a fork and transfer to one of the prepared baking sheets. Repeat with three remaining rounds. Form 12 more empanadas in the same manner with remaining pastry and filling, arranging them about 1 1/2 inches apart on baking sheets.",
        "Step 4: Brush tops of empanadas with beaten egg. Bake in the preheated oven, switching position of sheets halfway through, until golden brown, about 15 minutes."
    ],
    "image": "images/argentinian-beef-empanadas.jpg"
}