{
    "title": "Ash Reshteh",
    "file_name": "ash-reshteh",
    "url": "https://www.allrecipes.com/ash-reshteh-recipe-7182189",
    "cuisine": "Greek",
    "difficulty": "Medium",
    "cooking_time": "60 minutes",
    "country": "Greece",
    "continent": "Europe",
    "metadata": {
        "prep_time": "30 mins",
        "cook_time": "1 hr 15 mins",
        "total_time": "1 hr 45 mins",
        "active_time": "Unknown",
        "servings": "6",
        "calories": "563 Calories"
    },
    "ingredients": [
        "3 large onions, divided",
        "9 tablespoons vegetable oil, divided",
        "2 tablespoons ghee or butter",
        "3 cloves garlic",
        "6 tablespoons dried mint, divided",
        "2 teaspoons turmeric, divided",
        "1 1/2 teaspoons kosher salt",
        "9 cups water, divided",
        "1 (15-oz.) can chickpeas,",
        "1 (15-oz.) can pinto beans, drained and rinsed",
        "3/4 cup lentils",
        "6 cups fresh spinach",
        "1 1/2 cups fresh parsley",
        "1 cup fresh cilantro",
        "2 tablespoons flour",
        "6 ounces fettuccine",
        "1 bulb garlic, cloves peeled and minced",
        "3 tablespoons yogurt"
    ],
    "method": [
        "Step 1: Thinly slice 2 onions. Heat 2 tablespoons oil and ghee over medium heat in a large pot. Add sliced onions and cook, stirring occasionally, until golden brown, about 15 minutes. Add minced garlic cloves and cook, stirring frequently, about 2 minutes. Stir in 1 tablespoon dried mint, 1 1/2 teaspoons turmeric, and salt. Add 8 1/2 cups water, chickpeas, pinto beans, and lentils.",
        "Step 2: Increase heat to medium-high and bring to a simmer. Stir in spinach, parsley, and cilantro. Return mixture to a simmer. Cook over low heat, covered, until lentils are tender, about 30 minutes.",
        "Step 3: Meanwhile, heat 2 tablespoons oil in a small saucepan. Add 2 tablespoons dried mint and cook until fragrant, about 2 minutes. Stir mint into soup. Season soup to taste.",
        "Step 4: Stir together flour and 1/3 cup water in a small bowl; add to soup. Increase heat to medium. Add reshteh and simmer, uncovered, stirring occasionally, until noodles are tender and soup is thickened, about 12 minutes.",
        "Step 5: For toppers, slice remaining onion. Heat 2 tablespoons oil in a skillet over medium-high heat. Add onion; cook, stirring occasionally, until golden brown, about 10 minutes. Stir in remaining 1/2 teaspoon turmeric and cook for 1 minute more. Transfer onion mixture to a plate.",
        "Step 6: Reduce heat to medium. Stir minced garlic bulb into the skillet and cook, adding more oil as needed, until golden and crispy, about 3 minutes. Transfer garlic to a bowl. Add remaining 3 tablespoons dried mint and 3 tablespoons vegetable oil to the skillet. Cook over medium heat, stirring, until fragrant, 2 to 3 minutes. Transfer sautéed mint to a bowl using a slotted spoon. Stir together kashk and remaining 1/2 cup water in a small bowl.",
        "Step 7: Top soup servings with sautéed onion, crispy garlic, and fried mint; drizzle with kashk mixture.",
        "Step 8: Reshteh",
        "Step 9: Look for these thin flour noodles in Persian or Middle Eastern groceries—or use fettuccine and add 1/2 teaspoon salt in Step 3.",
        "Step 10: Ghee",
        "Step 11: A type of clarified butter, ghee is commonly used in Middle Eastern and South Asian cooking. You can substitute butter if you don’t have ghee."
    ],
    "image": "images/ash-reshteh.jpg"
}