{
    "title": "Avocado Toast and Egg for One",
    "file_name": "avocado-toast-and-egg-for-one",
    "url": "https://www.allrecipes.com/recipe/279650/avocado-toast-and-egg-for-one/",
    "cuisine": "Australian",
    "difficulty": "Easy",
    "cooking_time": "20 minutes",
    "country": "Australia",
    "continent": "Oceania",
    "metadata": {
        "prep_time": "10 mins",
        "cook_time": "10 mins",
        "total_time": "20 mins",
        "active_time": "Unknown",
        "servings": "1",
        "calories": "443 Calories"
    },
    "ingredients": [
        "1 small shallot, thinly sliced into rings",
        "1 tablespoon red wine vinegar",
        "salt to taste",
        "1 small avocado, pitted and peeled",
        "¼  lime, juiced",
        "1  egg",
        "1 tablespoon white vinegar",
        "freshly ground black pepper to taste",
        "1 slice whole-grain crusty bread",
        "1 pinch Aleppo pepper, to taste"
    ],
    "method": [
        "Step 1: Combine shallot, red wine vinegar, and a pinch of salt in a bowl; set aside. Mash avocado with lime juice and salt in a second bowl.",
        "Step 2: Heat 2 to 3 inches of water in a small, shallow saucepan until boiling. Add vinegar and reduce heat to a light simmer. Crack egg into a small ramekin and lower it to the surface of the water, carefully easing it out of the ramekin into the simmering water. Poach egg until white is completely set and yolk is slightly soft, 3 to 4 minutes. Remove with a slotted spoon and transfer to a paper-towel lined plate. Sprinkle with salt and pepper.",
        "Step 3: Toast bread to your liking and remove to a plate. Top with mashed avocado, some of the pickled shallot, and poached egg. Sprinkle with aleppo pepper and serve immediately.",
        "Step 4: You may substitute 1 thin slice of red onion, rings separated, for the shallot. I like to make a small batch of pickled shallot or red onion ahead of time to have on hand in the fridge. Place in a small jar and top with enough vinegar to cover.",
        "Step 5: Poached eggs can be prepared ahead of time and kept in the refrigerator for 1 to 2 days. After poaching, immerse them into ice water to cool, cover, and place in the refrigerator. When ready to serve, bring a saucepan of water to a boil, then turn off heat. Place eggs into the warm water until warmed through, 30 to 60 seconds. For a more even poached egg shape, trim off any wispy edges with a knife, if desired.",
        "Step 6: Use your favorite seasoning instead of the aleppo pepper, if desired.",
        "Step 7: Nutrition data for this recipe includes the full amount of pickled shallot. The actual amount of pickled shallot consumed will vary."
    ],
    "image": "images/avocado-toast-and-egg-for-one.jpg"
}