{
    "title": "Ba'corn Cheese Corn",
    "file_name": "ba'corn-cheese-corn",
    "url": "https://www.allrecipes.com/recipe/274640/bacorn-cheese-corn/",
    "cuisine": "Peruvian",
    "difficulty": "Easy",
    "cooking_time": "20 minutes",
    "country": "Peru",
    "continent": "South America",
    "metadata": {
        "prep_time": "15 mins",
        "cook_time": "25 mins",
        "total_time": "40 mins",
        "active_time": "Unknown",
        "servings": "10",
        "calories": "268 Calories"
    },
    "ingredients": [
        "1 (8 ounce) package bacon, chopped",
        "2 (16 ounce) packages frozen sweet corn, thawed",
        "4 cloves garlic, minced",
        "1 bunch green onions, sliced",
        "2  jalapeno peppers, diced, or more to taste",
        "1 pinch salt and freshly ground black pepper to taste",
        "1 pinch cayenne pepper, or to taste",
        "1 cup heavy cream",
        "2 ounces shredded mozzarella cheese",
        "4 ounces shredded Monterey Jack cheese"
    ],
    "method": [
        "Step 1: Cook bacon in a 10-inch cast iron skillet over medium-high heat, stirring occasionally, until almost crisp and fat is rendered, 7 to 8 minutes.",
        "Step 2: Set an oven rack about 6 inches from the heat source and preheat the oven's broiler.",
        "Step 3: Drain frozen corn thoroughly in a colander. Add 1/2 of the corn to the skillet with the bacon. Cook and stir until kernels just start to turn golden brown, 3 to 5 minutes. Add garlic, green onions, and jalapenos; cook until vegetables start to soften and sweeten up, 3 to 4 minutes. Tilt pan to drain off some of the fat, using a paper towel to soak it up.",
        "Step 4: Season with salt, pepper, and cayenne. Pour in cream; stir and bring to a boil. Stir in the remaining corn until heated through. Turn off the heat and add about 2/3 of the mozzarella and Monterey Jack cheese. Stir to combine. Top corn with remaining cheese and a sprinkle of cayenne.",
        "Step 5: Broil until heated through and top is browned, 5 to 10 minutes. Serve immediately."
    ],
    "image": "images/ba'corn-cheese-corn.jpg"
}