{
    "title": "Bacon Oatmeal Breakfast Cookies With Maple Glaze",
    "file_name": "bacon-oatmeal-breakfast-cookies-with-maple-glaze",
    "url": "https://www.allrecipes.com/recipe/218926/bacon-oatmeal-breakfast-cookies-with-maple-glaze/",
    "cuisine": "Canadian",
    "difficulty": "Easy",
    "cooking_time": "25 minutes",
    "country": "Canada",
    "continent": "North America",
    "metadata": {
        "prep_time": "30 mins",
        "cook_time": "20 mins",
        "total_time": "1 hr 15 mins",
        "active_time": "Unknown",
        "servings": "18",
        "calories": "196 Calories"
    },
    "ingredients": [
        "8 ounces bacon",
        "½ cup unsalted butter, softened",
        "½ cup white sugar",
        "½ cup packed brown sugar",
        "1  egg",
        "½ teaspoon vanilla extract",
        "1 cup all-purpose flour",
        "1 teaspoon ground cinnamon",
        "½ teaspoon baking soda",
        "½ teaspoon salt",
        "1 ½ cups quick-cooking oats",
        "⅞ cup confectioners' sugar",
        "1 ½ tablespoons water, or as needed",
        "1 ½ tablespoons real maple syrup"
    ],
    "method": [
        "Step 1: Cook bacon in a large, deep skillet over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain on a paper towel-lined plate. When cool, chop bacon; set aside.",
        "Step 2: Beat butter, white sugar, and brown sugar together in a large mixing bowl with an electric mixer on medium speed until fluffy, beat in egg and vanilla extract until thoroughly combined. Whisk flour, cinnamon, baking soda, and salt together in a separate bowl; stir into butter mixture. Gradually stir in bacon and oats, about 1/3 cup oats at a time. Cover dough with plastic wrap; refrigerate at least 1 hour.",
        "Step 3: Preheat the oven to 375 degrees F (190 degrees C). Thoroughly grease baking sheets.",
        "Step 4: Scoop about 1/3 cup dough per cookie and roll into balls; place at least 3 inches apart on the prepared baking sheets. Flatten balls slightly using a fork dipped in water.",
        "Step 5: Bake in the preheated oven until golden brown with slightly browner edges, 10 to 12 minutes. Cool on baking sheets 3 to 5 minutes before transferring to wire racks to cool completely.",
        "Step 6: Meanwhile, whisk confectioners' sugar, water, and maple syrup together in a bowl until smooth; let stand about 5 minutes to slightly thicken. Drizzle on tops of cookies; let stand about 20 minutes to set before storing."
    ],
    "image": "images/bacon-oatmeal-breakfast-cookies-with-maple-glaze.jpg"
}