{
    "title": "Baked Chicken Taquitos",
    "file_name": "baked-chicken-taquitos",
    "url": "https://www.allrecipes.com/recipe/278836/baked-chicken-taquitos/",
    "cuisine": "Mexican",
    "difficulty": "Easy",
    "cooking_time": "25 minutes",
    "country": "Mexico",
    "continent": "North America",
    "metadata": {
        "prep_time": "35 mins",
        "cook_time": "30 mins",
        "total_time": "1 hr 5 mins",
        "active_time": "Unknown",
        "servings": "12",
        "calories": "377 Calories"
    },
    "ingredients": [
        "olive oil cooking spray",
        "1 tablespoon olive oil, or more as needed",
        "1 ½ cups finely chopped tomatoes",
        "½ cup minced onion",
        "5 cloves garlic, minced",
        "3  jalapeno peppers, seeded and minced",
        "⅓ cup chicken broth",
        "¼ cup taco sauce",
        "2 tablespoons all-purpose flour",
        "2 teaspoons ground cumin",
        "2 teaspoons dried oregano",
        "2 teaspoons chili powder",
        "½ teaspoon salt",
        "1 pound shredded, cooked rotisserie chicken",
        "24 (6 inch) corn tortillas",
        "3 cups shredded sharp Cheddar cheese",
        "1 cup shredded lettuce, or to taste",
        "½ cup sour cream",
        "½ cup guacamole, or to taste"
    ],
    "method": [
        "Step 1: Preheat the oven to 350 degrees F (175 degrees C). Spray a large baking pan with olive oil cooking spray.",
        "Step 2: Heat oil in a large skillet over medium heat. Add tomatoes, onion, garlic, and jalapeno peppers, then stir in chicken broth, taco sauce, flour, cumin, oregano, chili powder, and salt. Cook until heated through, 5 to 10 minutes. Add shredded chicken, mixing vigorously until ingredients are well blended; cook until hot, 2 to 3 minutes.",
        "Step 3: Wrap 8 tortillas in damp paper towels and microwave on high until soft and flexible, about 30 seconds. Repeat twice more to heat remaining tortillas.",
        "Step 4: Spoon about 2 tablespoons chicken mixture down the center of a tortilla and sprinkle with Cheddar cheese. Roll tightly around the filling and place seam-side down in the prepared baking dish. Repeat to form remaining taquitos. Spray taquitos with cooking spray and sprinkle with remaining Cheddar cheese.",
        "Step 5: Bake in the preheated oven until cheese is melted and taquitos are crispy, 20 to 22 minutes.",
        "Step 6: Place shredded lettuce on a serving platter and arrange taquitos on top. Serve with sour cream and guacamole.",
        "Step 7: You can secure taquitos with toothpicks before baking, if needed."
    ],
    "image": "images/baked-chicken-taquitos.jpg"
}