{
    "title": "Best Pennsylvania Dutch Chicken Corn Soup",
    "file_name": "best-pennsylvania-dutch-chicken-corn-soup",
    "url": "https://www.allrecipes.com/recipe/26365/best-pennsylvania-dutch-chicken-corn-soup/",
    "cuisine": "Australian",
    "difficulty": "Easy",
    "cooking_time": "30 minutes",
    "country": "Australia",
    "continent": "Oceania",
    "metadata": {
        "prep_time": "30 mins",
        "cook_time": "2 hrs 30 mins",
        "total_time": "9 hrs",
        "active_time": "Unknown",
        "servings": "12",
        "calories": "437 Calories"
    },
    "ingredients": [
        "2 (3 pound) whole chickens, cut into pieces",
        "3 quarts water",
        "3  onions, minced",
        "1 cup chopped celery",
        "2 ½ tablespoons salt",
        "1 ¼ teaspoons ground nutmeg",
        "¼ teaspoon ground black pepper",
        "10 ears fresh corn, kernels cut from cob",
        "3  eggs, divided",
        "1 cup sifted all-purpose flour",
        "½ cup milk"
    ],
    "method": [
        "Step 1: Combine chicken, water, onions, celery, salt, nutmeg, and pepper in a large stockpot over medium heat and bring to a boil; reduce heat and simmer, adding water as needed, until chicken is very tender, about 2 hours.",
        "Step 2: Transfer chicken to a deep dish; pour soup into a large jug or bowl. Cover and refrigerate chicken and soup for 6 to 8 hours.",
        "Step 3: Remove and discard the layer of fat that has solidified on the surface of soup. Transfer soup into a large pot over medium heat; stir in corn and bring to a boil. Reduce heat and simmer until corn is tender, 10 to 15 minutes.",
        "Step 4: Meanwhile, place 2 of the eggs in a small saucepan and cover with cold water. Bring to a boil and immediately remove from heat. Cover and let eggs stand in hot water for 10 to 12 minutes. Remove from hot water, cool, peel, and chop. Set aside.",
        "Step 5: Chop chilled chicken meat into small chunks; stir into soup.",
        "Step 6: Beat remaining egg in a medium bowl until light in color. Beat in flour and milk until smooth. Drop pea-sized lumps of rivel dough into the soup, a few at a time, to make small dumplings. Cook, stirring constantly, until dumplings hold their shape and float to the surface, 2 to 5 minutes. Stir in chopped egg."
    ],
    "image": "images/best-pennsylvania-dutch-chicken-corn-soup.jpg"
}