{
    "title": "Cheese and Potato Stuffed Flatbread",
    "file_name": "cheese-and-potato-stuffed-flatbread",
    "url": "https://www.allrecipes.com/georgian-style-cheese-and-potato-stuffed-flatbread-recipe-7973237",
    "cuisine": "Peruvian",
    "difficulty": "Easy",
    "cooking_time": "30 minutes",
    "country": "Peru",
    "continent": "South America",
    "metadata": {
        "prep_time": "30 mins",
        "cook_time": "1 hr 12 mins",
        "total_time": "2 hrs 32 mins",
        "active_time": "Unknown",
        "servings": "6",
        "calories": "440 Calories"
    },
    "ingredients": [
        "2  russet potatoes",
        "1 cup all-purpose flour",
        "1/4 cup milk",
        "2 tablespoons water",
        "1/4 teaspoon salt",
        "1 tablespoon melted butter",
        "2 tablespoons green onions (optional)",
        "2 tablespoons green chilies (optional)",
        "4 ounces mozzarella cheese, cut into very small cubes",
        "1 ounces sharp Cheddar cheese",
        "3 ounces feta cheese, crumbled",
        "salt and freshly ground black pepper to taste",
        "3 tablespoons butter, divided",
        "2 tablespoons honey",
        "1 teaspoon hot chili pepper flakes",
        "1 tablespoon green onions (optional)"
    ],
    "method": [
        "Step 1: Preheat the oven to 400 degrees F (200 degrees C). Place potatoes in a baking dish, and pierce skins several times with a knife.",
        "Step 2: Bake potatoes in the preheated oven until very tender when tested with a knife, about 1 hour. Remove from the oven, cover with a towel, and cool potatoes to room temperature, about 30 minutes. Turn oven off.",
        "Step 3: Place flour in a bowl, and make a small well in the center with a fork. Pour milk, water, and salt into the well, and stir with a fork to form a shaggy dough.",
        "Step 4: Pour in the 1 tablespoon melted butter, and continue to mix with a fork until dough begins to come together. Lightly flour your hand and knead in the bowl until the sides of the bowl are clean, and dough forms into a ball.",
        "Step 5: Transfer dough to a lightly floured work surface and knead until dough is smooth and slightly elastic, 2 to 4 minutes. Wrap dough in plastic wrap and set aside to rest for 15 to 30 minutes.",
        "Step 6: Measure out 8 ounces of cooled, cooked potato; add to a bowl and mash with the back of a fork, until slightly chunky or completely smooth, as desired.",
        "Step 7: Add green onions, green chilies, mozzarella, Cheddar, and feta cheese and stir thoroughly to combine. Season with salt and pepper. Mash filling into a compact disc, about 5 inches in diameter, in the bottom of the bowl. Turn filling out onto a piece of plastic wrap. Wrap tightly, give filling a final shaping, and place in the refrigerator until ready to use.",
        "Step 8: Roll dough out on a well-floured work surface into a 10- to 11-inch circle. Place chilled filling disc in center of dough circle.",
        "Step 9: Working around the circle, fold dough up toward the center to cover filling completely, pleating dough as needed and using a moistened finger to stick dough together where it overlaps. Flour the top, and flip over so the seam side is down.",
        "Step 10: Again, flour the top of filled dough, and roll gently into an even circle, 3/4- to 1-inch thick.",
        "Step 11: Melt 2 tablespoons butter in a nonstick skillet over medium heat. Gently place filled bread in the skillet and cook, covered, until the bottom is a light golden brown, about 5 minutes. Carefully flip over, and cook, covered, until the other side is golden, about 5 minutes.",
        "Step 12: Turn bread back over, and brush top and sides with remaining 1 tablespoon melted butter. Cook for 1 to 2 minutes more. If flatbread begins to bulge, poke a small hole with a knife to release steam.",
        "Step 13: Transfer to a cutting board and cool for 5 to 10 minutes.",
        "Step 14: Meanwhile, stir honey and pepper flakes together in a small bowl. Sprinkle flatbread with green onions, cut into wedges, and serve with spicy honey."
    ],
    "image": "images/cheese-and-potato-stuffed-flatbread.jpg"
}