{
    "title": "Chef John's Pumpkin-Braised Pork",
    "file_name": "chef-john's-pumpkin-braised-pork",
    "url": "https://www.allrecipes.com/recipe/268930/chef-johns-pumpkin-braised-pork/",
    "cuisine": "Chinese",
    "difficulty": "Medium",
    "cooking_time": "30 minutes",
    "country": "China",
    "continent": "Asia",
    "metadata": {
        "prep_time": "15 mins",
        "cook_time": "4 hrs 15 mins",
        "total_time": "12 hrs 45 mins",
        "active_time": "Unknown",
        "servings": "10",
        "calories": "348 Calories"
    },
    "ingredients": [
        "3 ½ pounds boneless pork shoulder",
        "⅓ cup thinly sliced shallots",
        "1 tablespoon kosher salt",
        "1 tablespoon chopped fresh rosemary",
        "2 teaspoons freshly ground black pepper",
        "1 teaspoon crushed fennel seeds",
        "½ teaspoon dried thyme",
        "¼ teaspoon cayenne pepper",
        "2 tablespoons all-purpose flour",
        "1 tablespoon olive oil",
        "1  volleyball-sized) sugar pumpkin",
        "2 cups hard apple cider, or more as needed"
    ],
    "method": [
        "Step 1: Cut pork into large chunks; place in a bowl. Add shallots, salt, rosemary, black pepper, fennel seeds, thyme, and cayenne. Mix thoroughly; cover pork with parchment paper. Refrigerate to let flavors develop, 8 hours to overnight.",
        "Step 2: Preheat the oven to 350 degrees F (175 degrees C).",
        "Step 3: Add flour to pork; toss to coat. Heat oil in a skillet over medium-high heat. Cook pork in 2 batches until browned, about 3 minutes per side.",
        "Step 4: Slowly cut top off pumpkin by inserting the tip of a knife at a 45-degree angle into top; cut all the way around to remove \"lid\" with stem. Scrape seeds and fibers off bottom of lid and inside pumpkin using a large spoon or ice cream scoop.",
        "Step 5: Line bottom of a baking pan with parchment paper; place pumpkin on top. Stuff pumpkin with browned pork; pour in cider. Cover with pumpkin lid.",
        "Step 6: Bake in the preheated oven until pork is very tender, about 4 hours, adding a little more cider after a few hours, since it evaporates a lot. Remove from oven; let rest. Brush pumpkin with some rendered fat from bottom of the pan.",
        "Step 7: Scoop pork onto serving plates; cut out pieces of pumpkin to serve alongside. Combine remaining rendered fat with cooking liquid from inside pumpkin; let rest a few minutes. Skim most fat off top of sauce; spoon over pork.",
        "Step 8: While this would work in any pumpkin, try to find ones sold as \"sugar,\" or \"pie\" pumpkins, since they have a thicker, sweeter flesh, compared to the ornamental ones sold for jack-o'-lantering. I believe the variety I used was called \"cannonball,\" but simply look for round, heavy-feeling varieties about the size of a volleyball.",
        "Step 9: You can use up to 4 pounds of pork.",
        "Step 10: Thanks to the little bit of flour on the pork, the sauce should have a nice thickness, but you can always adjust that with some more roux."
    ],
    "image": "images/chef-john's-pumpkin-braised-pork.jpg"
}