{
    "title": "Chef John's Cheese Blintzes",
    "file_name": "chef-john's-cheese-blintzes",
    "url": "https://www.allrecipes.com/recipe/242406/chef-johns-cheese-blintzes/",
    "cuisine": "Jewish",
    "difficulty": "Medium",
    "cooking_time": "60 minutes",
    "country": "Israel",
    "continent": "Asia",
    "metadata": {
        "prep_time": "20 mins",
        "cook_time": "30 mins",
        "total_time": "1 hr 30 mins",
        "active_time": "Unknown",
        "servings": "5",
        "calories": "452 Calories"
    },
    "ingredients": [
        "1 cup milk",
        "1 cup all-purpose flour",
        "¼ cup cold water",
        "3 large eggs",
        "2 tablespoons vegetable oil",
        "1 tablespoon white sugar",
        "½ teaspoon salt",
        "¼ teaspoon vanilla extract",
        "cooking spray",
        "1 tablespoon butter, or as needed",
        "1 ½ cups ricotta cheese, strained if wet",
        "½ cup cream cheese, at room temperature",
        "1 large egg",
        "3 tablespoons powdered sugar, divided, or more as needed",
        "1 medium lemon, zested",
        "1 pinch salt"
    ],
    "method": [
        "Step 1: Gather all ingredients.",
        "Step 2: Make the batter: Combine milk, flour, water, eggs, oil, sugar, salt, and vanilla in a blender. Blend until completely smooth, 1 or 2 minutes, scraping down the sides as needed. Let batter sit at room temperature for 30 minutes.",
        "Step 3: Meanwhile, make the filling: Whisk ricotta cheese, cream cheese, egg, 2 tablespoons powdered sugar, lemon zest, and salt together in a mixing bowl until thoroughly combined. Cover and refrigerate until needed.",
        "Step 4: When batter has rested, heat a 10-inch, nonstick skillet over medium-high heat. Spray with cooking spray and pour in about 1/4 cup batter.",
        "Step 5: Immediately swirl batter around to coat the bottom of the skillet. Cook until the surface looks dry, about 1 minute.",
        "Step 6: Flip crêpe and briefly cook the other side, about 30 seconds. Transfer to a plate. Repeat to cook and stack remaining crêpes.",
        "Step 7: Preheat the oven to 325 degrees F (165 degrees C). Lightly grease a baking dish.",
        "Step 8: Spoon 3 to 4 tablespoons filling onto each crêpe, about 1 inch from the edge nearest you. Fold the edge over filling and flatten slightly.",
        "Step 9: Fold in both sides, then roll crêpe into a small filled rectangle (blintz), ending with the seam on the bottom.",
        "Step 10: Melt butter in a large skillet over medium heat. Working in batches, cook several blintzes at a time until golden brown, turning gently, about 1 minute per side. Transfer to the prepared baking dish.",
        "Step 11: Bake in the preheated oven to firm up the filling, about 12 minutes.",
        "Step 12: Cool blintzes for 10 minutes, then dust lightly with remaining powdered sugar and serve."
    ],
    "image": "images/chef-john's-cheese-blintzes.jpg"
}