{
    "title": "Chocolate Yule Log",
    "file_name": "chocolate-yule-log",
    "url": "https://www.allrecipes.com/recipe/269557/chocolate-yule-log/",
    "cuisine": "French",
    "difficulty": "Hard",
    "cooking_time": "120 minutes",
    "country": "France",
    "continent": "Europe",
    "metadata": {
        "prep_time": "50 mins",
        "cook_time": "10 mins",
        "total_time": "3 hrs 15 mins",
        "active_time": "Unknown",
        "servings": "10",
        "calories": "526 Calories"
    },
    "ingredients": [
        "1 ⅔ cups powdered sugar",
        "½ cup unsalted butter, at room temperature",
        "2 tablespoons coffee-flavored liqueur",
        "1 ½ tablespoons unsweetened cocoa powder",
        "1 pinch salt",
        "⅓ cup mascarpone cheese",
        "2 tablespoons melted butter",
        "½ cup unsweetened cocoa powder",
        "2 tablespoons all-purpose flour",
        "½ teaspoon kosher salt",
        "5 large eggs, at room temperature",
        "⅔ cup white sugar",
        "½ teaspoon vanilla",
        "2 tablespoons powdered sugar, or as needed",
        "1 cup heavy cream, boiling-hot",
        "1 (8 ounce) package dark chocolate chips"
    ],
    "method": [
        "Step 1: To make the buttercream filling: Whip powdered sugar, butter, coffee-flavored liqueur, cocoa powder, and salt together in the bowl of a stand mixer fitted with the whisk attachment on high speed.",
        "Step 2: Transfer filling mixture to a separate bowl and add mascarpone cheese. Mix until combined; set aside. Clean and dry the stand mixer bowl.",
        "Step 3: Preheat the oven to 400 degrees F (200 degrees C).",
        "Step 4: Prepare a 13x18-inch rimmed sheet pan for the sponge cake: Brush a little melted butter over the sheet pan, then line the pan with parchment paper, and brush remaining melted butter on top.",
        "Step 5: Whisk cocoa powder, flour, and salt together in a bowl, making sure to break up any clumps.",
        "Step 6: Place eggs in the clean bowl of your stand mixer. Add sugar and whip with the whisk attachment until fluffy, thick, and very light in color, 2 to 3 minutes.",
        "Step 7: Add vanilla and 1/2 of the cocoa powder mixture; mix on low speed for a few seconds.",
        "Step 8: Add remaining cocoa mixture and mix on low for a few seconds. Switch to high speed and mix until the mixture is moistened but not fully blended.",
        "Step 9: Pull off the whisk attachment and use it to whisk the batter by hand until evenly blended.",
        "Step 10: Pour batter onto the prepared sheet pan and spread out with a spatula, almost to the edges, but not quite. Tap the pan on the counter several times to remove any large air bubbles.",
        "Step 11: Bake in the preheated oven until the top is dry and the edges start to pull away from the sides, 8 to 10 minutes.",
        "Step 12: While the cake is baking, sift powdered sugar onto a clean kitchen towel to cover an area slightly larger than the sponge cake.",
        "Step 13: Remove cake from the oven. Run a knife around the edges of the pan. Dust some powdered sugar over the top. Run a spatula under the parchment paper to make sure it's not stuck to the pan.",
        "Step 14: Quickly flip the pan on top of the sugared area on the towel to invert the cake.",
        "Step 15: Carefully remove the parchment paper, then sift more powdered sugar over the cake.",
        "Step 16: Gently roll the cake up inside the towel; allow to cool for 15 minutes.",
        "Step 17: Carefully unroll the cooled cake. Dollop as much buttercream filling as you like on top, reserving some for later; spread to the edges.",
        "Step 18: Roll cake up over the filling, using the towel to lift it if needed.",
        "Step 19: Sprinkle more powdered sugar on top over the log, then wrap in plastic wrap. Refrigerate until firm, about 2 hours.",
        "Step 20: To make the ganache frosting: Pour hot cream over chocolate chips in a bowl. Let sit for 1 minute, then whisk until chocolate is melted.",
        "Step 21: Make an angled cut 3 inches from one end of the log. Place log on a parchment-lined sheet pan.",
        "Step 22: Apply some filling to the angled slice and attach it to one side of the log.",
        "Step 23: Spread a layer of ganache all over the cake, except for the swirls on the ends. Refrigerate for 15 minutes to firm up the ganache.",
        "Step 24: Use the tip of a knife to carve lines into the ganache to create the appearance of tree bark. Refrigerate until completely chilled.",
        "Step 25: Dust with cocoa powder and powdered sugar before serving."
    ],
    "image": "images/chocolate-yule-log.jpg"
}