{
    "title": "Coxinhas (Brazilian Chicken Croquettes)",
    "file_name": "coxinhas-brazilian-chicken-croquettes",
    "url": "https://www.allrecipes.com/recipe/265322/coxinhas-brazilian-chicken-croquettes/",
    "cuisine": "Brazilian",
    "difficulty": "Medium",
    "cooking_time": "40 minutes",
    "country": "Brazil",
    "continent": "South America",
    "metadata": {
        "prep_time": "1 hr",
        "cook_time": "1 hr",
        "total_time": "2 hrs",
        "active_time": "Unknown",
        "servings": "20",
        "calories": "167 Calories"
    },
    "ingredients": [
        "2 small skinless, boneless chicken breast halves",
        "1 cup chicken broth, or more as needed",
        "1 tablespoon olive oil",
        "1  onion, chopped",
        "5  chopped green olives, or to taste",
        "2 tablespoons chopped fresh parsley",
        "salt and pepper to taste",
        "2 cups chicken broth",
        "2 tablespoons butter",
        "salt to taste",
        "2 cups all-purpose flour",
        "1 cup all-purpose flour",
        "2  eggs, beaten",
        "1 cup dry bread crumbs",
        "oil for frying"
    ],
    "method": [
        "Step 1: Combine chicken breasts and 1 cup chicken broth in a pot over medium heat. Bring to a boil, reduce heat, cover, and simmer until chicken is cooked through, 20 to 30 minutes. Keep checking that there is enough liquid in the pot and add more broth if necessary. Remove chicken from pot, allow to cool briefly, and shred with 2 forks.",
        "Step 2: Heat olive oil in a skillet over medium heat and cook onion until soft and translucent, about 5 minutes. Add shredded chicken, olives, and parsley. Stir well and season with salt and pepper. Remove filling from heat and set aside.",
        "Step 3: Heat 2 cups chicken broth and butter in a large saucepan over medium heat; season with salt and bring to a simmer. Add flour all at once and stir to form a thick paste. Stir vigorously until mixture is smooth and no longer sticks to the bottom of the pan. Remove from heat and let pastry cool.",
        "Step 4: Once pastry is cool enough to handle, transfer to an oiled work surface and knead until smooth, 2 to 3 minutes.",
        "Step 5: Take a portion of pastry and roll into a golf ball-sized ball. Stick an oiled finger into the center of the ball and press edges to create a small bowl. Stuff with 2 teaspoons chicken filling and gather top edges to seal, rolling into a teardrop shape. Set croquette aside and cover with a damp towel. Repeat with remaining pastry and filling.",
        "Step 6: Set out 3 bowls in the following order: flour, beaten eggs, bread crumbs. Roll each croquette in flour, then dip in egg, then cover in breadcrumbs.",
        "Step 7: Heat oil for frying in a large saucepan or deep fryer to 350 degrees F (175 degrees C). Fry croquettes in batches, until golden brown on all sides, 7 to 10 minutes. Remove from oil and drain on paper towels.",
        "Step 8: We have corrected this recipe to call for 2 cups all-purpose flour in the pastry."
    ],
    "image": "images/coxinhas-brazilian-chicken-croquettes.jpg"
}