{
    "title": "Crispy Oven-Roasted Breakfast Potatoes",
    "file_name": "crispy-oven-roasted-breakfast-potatoes",
    "url": "https://www.allrecipes.com/crispy-oven-roasted-breakfast-potatoes-recipe-7496452",
    "cuisine": "Nigerian",
    "difficulty": "Easy",
    "cooking_time": "30 minutes",
    "country": "Nigeria",
    "continent": "Africa",
    "metadata": {
        "prep_time": "20 mins",
        "cook_time": "1 hr",
        "total_time": "1 hr 20 mins",
        "active_time": "Unknown",
        "servings": "4",
        "calories": "414 Calories"
    },
    "ingredients": [
        "2 1/4 pounds Yukon Gold potatoes",
        "6 cups water",
        "4 1/2 teaspoons kosher salt",
        "1/2 teaspoon baking soda",
        "3 tablespoons olive oil",
        "1/8 teaspoon garlic powder",
        "1/8 teaspoon onion powder",
        "1/4 teaspoon smoked paprika",
        "1/4 teaspoon black pepper",
        "a pinch of cayenne",
        "2 tablespoons olive oil",
        "3/4 cup red onion",
        "1/2 cup peppers",
        "salt",
        "1/3 cup green onions"
    ],
    "method": [
        "Step 1: Combine water, 4 1/2 teaspoons kosher salt, and baking soda in a large pot over high heat and bring to boil. Add potatoes, reduce heat to simmer, and cook until just barely tender, 10 to 12 minutes. Drain and let sit for 30 seconds.",
        "Step 2: Meanwhile, whisk together olive oil, garlic powder, onion powder, paprika, ground pepper, and cayenne in a large mixing bowl.",
        "Step 3: Transfer potatoes into the bowl of seasoned oil and toss with a spatula until potatoes are evenly coated, and are roughened up a bit on the surface.",
        "Step 4: Preheat the oven to 450 degrees F (230 degrees C). Line a baking sheet with parchment paper.",
        "Step 5: Spread out potatoes on the prepared baking sheet and smear any excess mashed potato bits in the bowl over the tops of the potatoes. Season with a pinch of salt.",
        "Step 6: Roast in the preheated oven until potatoes are browned, and the edges are very crispy, 45 to 60 minutes. For best results, turn potatoes over every 15 to 20 minutes until done.",
        "Step 7: Meanwhile, heat olive oil in a large skillet over medium heat. Add onions, peppers, and salt and cook, stirring, until onions are soft and translucent and peppers have softened and sweetened, about 5 minutes. Turn off heat and stir in green onions to be cooked by the residual heat.",
        "Step 8: Serve hot, topped with sauteed onions and peppers."
    ],
    "image": "images/crispy-oven-roasted-breakfast-potatoes.jpg"
}