{
    "title": "Detroit-Style Pizza",
    "file_name": "detroit-style-pizza",
    "url": "https://www.allrecipes.com/recipe/268466/detroit-style-pizza/",
    "cuisine": "American",
    "difficulty": "Medium",
    "cooking_time": "45 minutes",
    "country": "United States",
    "continent": "North America",
    "metadata": {
        "prep_time": "25 mins",
        "cook_time": "15 mins",
        "total_time": "1 hr 45 mins",
        "active_time": "Unknown",
        "servings": "9",
        "calories": "474 Calories"
    },
    "ingredients": [
        "1 cup warm water",
        "1 (.25 ounce) package active dry yeast",
        "1 teaspoon white sugar",
        "2 ½ cups bread flour",
        "3 teaspoons olive oil, divided",
        "1 teaspoon kosher salt",
        "1 (24 ounce) jar marinara sauce",
        "2 teaspoons dried oregano",
        "1 teaspoon red pepper flakes",
        "1 teaspoon garlic powder",
        "8 ounces Monterey Jack cheese",
        "4 ounces shredded mild Cheddar cheese",
        "1 (8 ounce) package thick pepperoni slices"
    ],
    "method": [
        "Step 1: Gather all ingredients.",
        "Step 2: Pour warm water into the bowl of stand mixer; mix in yeast and sugar and let dissolve.",
        "Step 3: Add 2 teaspoons olive oil, salt, and bread flour. Knead mixture together with a dough hook attachment until dough is very smooth, soft, and elastic.",
        "Step 4: Drizzle remaining 1 teaspoon oil onto a 10x14-inch Detroit-style pizza pan; use your fingers to spread oil over the bottom of the pan. Place dough in the center of the pan. Oil your fingers, then pull and stretch dough into a rectangular shape.",
        "Step 5: Cover and let rise until doubled in volume, about 1 hour.",
        "Step 6: Meanwhile, make the sauce: Bring marinara sauce, oregano, red pepper flakes, and garlic powder to a simmer in a saucepan over medium-low heat. Simmer for 15 minutes.",
        "Step 7: Preheat the oven to 525 degrees F (274 degrees C). Combine Monterey Jack and Cheddar cheese into bowl. Toss lightly to mix together.",
        "Step 8: Finish the dough: Rub fingertips with some olive oil from the pan. Press out air from the dough while stretching and pushing it into a rectangle that goes all the way to the edges of the pan. Stretch dough up the sides about 1/2 inch or so.",
        "Step 9: Lay almost all pepperoni slices onto dough. Scatter cheese evenly over top, making sure to fully cover all the edges where dough meets the pan.",
        "Step 10: Ladle sauce on top in three long strips. Arrange remaining pepperoni slices over top.",
        "Step 11: Bake in the preheated oven until pizza is a bit darker than golden brown, about 15 minutes. Let cool for 5 minutes.",
        "Step 12: Very carefully slide pizza onto a cutting board. Slice into rectangular pieces.",
        "Step 13: Serve immediately and enjoy!",
        "Step 14: Nutrition data for this recipe includes the full amount of sauce. The actual amount consumed will vary."
    ],
    "image": "images/detroit-style-pizza.jpg"
}