{
    "title": "Fully Loaded Cauliflower Salad",
    "file_name": "fully-loaded-cauliflower-salad",
    "url": "https://www.allrecipes.com/recipe/214918/fully-loaded-cauliflower-salad/",
    "cuisine": "American",
    "difficulty": "Easy",
    "cooking_time": "15 minutes",
    "country": "United States",
    "continent": "North America",
    "metadata": {
        "prep_time": "35 mins",
        "cook_time": "35 mins",
        "total_time": "2 hrs 10 mins",
        "active_time": "Unknown",
        "servings": "6",
        "calories": "200 Calories"
    },
    "ingredients": [
        "4 strips bacon",
        "1 head cauliflower, chopped into bite-sized pieces",
        "2 tablespoons extra-virgin olive oil",
        "2 cloves garlic, minced",
        "salt and ground black pepper to taste",
        "½ cup fat-free sour cream",
        "½ cup reduced-fat mayonnaise",
        "4 ounces shredded sharp white Cheddar cheese",
        "4  green onions, chopped",
        "1 bunch chopped fresh chives",
        "2 dashes hot pepper sauce (such as Frank's RedHot)",
        "¼ teaspoon paprika"
    ],
    "method": [
        "Step 1: Cook bacon in a large, deep skillet over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain on a paper towel-lined plate; crumble when cool.",
        "Step 2: Preheat the oven to 400 degrees F (200 degrees C). Line a baking sheet with aluminum foil.",
        "Step 3: Toss cauliflower, olive oil, garlic, salt, and black pepper together in large bowl; transfer to the prepared baking sheet.",
        "Step 4: Cook in the preheated oven until cauliflower is lightly browned, 15 to 20 minutes. Cool.",
        "Step 5: Combine cauliflower, sour cream, and mayonnaise in a large bowl; stir. Stir in Cheddar cheese, bacon bits, green onions, chives, pepper sauce, and paprika. Taste; adjust seasonings if needed. Refrigerate before serving, 1 to 2 hours.",
        "Step 6: If you have the time, this is also good with homemade dry ranch dressing mix stirred into the sour cream and mayonnaise before mixing with the cauliflower. If you like more or less mayonnaise and sour cream, start with a 1/4 cup more or less than what the recipe states. The cheese choice is all up to you. I like white Cheddar because I like the bite it gives to the salad. It's all personal, so have fun with the recipe! Baking time may vary depending on how done you want your cauliflower. We like this salad best with barbecued chicken or fish."
    ],
    "image": "images/fully-loaded-cauliflower-salad.jpg"
}