{
    "title": "Greek-Style Grilled Lamb Chops",
    "file_name": "greek-style-grilled-lamb-chops",
    "url": "https://www.allrecipes.com/greek-style-grilled-lamb-chops-recipe-8680071",
    "cuisine": "Greek",
    "difficulty": "Medium",
    "cooking_time": "50 minutes",
    "country": "Greece",
    "continent": "Europe",
    "metadata": {
        "prep_time": "10 mins",
        "cook_time": "10 mins",
        "total_time": "4 hrs 55 mins",
        "active_time": "Unknown",
        "servings": "4",
        "calories": "887 Calories"
    },
    "ingredients": [
        "8 cloves garlic",
        "6 tablespoons extra-virgin olive oil",
        "1/4 cup lemon juice",
        "1 tablespoon dried oregano",
        "1 tablespoon kosher salt",
        "1 teaspoon crushed red pepper",
        "3/4 teaspoon black pepper",
        "2 pounds lamb rib chops or (1-inch thick) lamb loin chops, trimmed"
    ],
    "method": [
        "Step 1: Gather all ingredients.",
        "Step 2: Whisk together garlic cloves, 1/4 cup olive oil, 3 tablespoons lemon juice, 2 teaspoons dried oregano, 2 teaspoons salt, 1/2 teaspoon red pepper, and 1/2 teaspoon black pepper in a small bowl until combined.",
        "Step 3: Place lamb chops in a resealable plastic bag, and pour marinade over chops. Remove air from bag, and seal. Store in the refrigerator to marinate at least 4 hours or up to 12 hours. Remove from refrigerator, and let stand 30 minutes to warm slightly.",
        "Step 4: Preheat an outdoor grill to High (450 to 500 degrees F (230 to 260 degrees C)). Scrape off excess marinade from lamb chops, and discard remaining marinade in bag. Sprinkle chops evenly with 1/2 teaspoon of the salt and remaining 1/4 teaspoon black pepper.",
        "Step 5: Place lamb chops on oiled grates; grill, covered, turning once or twice, until browned and a thermometer inserted into thickest portion of lamb chop registers 130 degrees F (54 degrees C) for medium-rare, about 4 minutes for rib chops and about 6 minutes for loin chops, or to desired degree of doneness. Carefully turn lamb chops with tongs to sear edges, as desired. Transfer lamb chops to a platter; let rest 5 minutes.",
        "Step 6: While lamb chops rest, whisk together remaining 2 tablespoons oil, 1 tablespoon lemon juice, 1 teaspoon oregano, 1/2 teaspoon salt, and 1/2 teaspoon crushed red pepper, as desired, in a small bowl until combined.",
        "Step 7: Drizzle olive oil mixture over lamb chops, and serve immediately with lemon wedges.",
        "Step 8: Recipe developed by Marianne Williams"
    ],
    "image": "images/greek-style-grilled-lamb-chops.jpg"
}