{
    "title": "Greek Lemon Chicken and Potato Bake",
    "file_name": "greek-lemon-chicken-and-potato-bake",
    "url": "https://www.allrecipes.com/recipe/242402/greek-lemon-chicken-and-potato-bake/",
    "cuisine": "Greek",
    "difficulty": "Medium",
    "cooking_time": "90 minutes",
    "country": "Greece",
    "continent": "Europe",
    "metadata": {
        "prep_time": "10 mins",
        "cook_time": "1 hr",
        "total_time": "1 hr 10 mins",
        "active_time": "Unknown",
        "servings": "4",
        "calories": "551 Calories"
    },
    "ingredients": [
        "4  chicken leg quarters",
        "1 (24 ounce) bag small potatoes",
        "½ cup olive oil",
        "2  lemons, juiced, divided",
        "2 tablespoons dried basil",
        "2 tablespoons dried oregano",
        "1 tablespoon salt",
        "1 tablespoon ground black pepper",
        "2 tablespoons lemon and herb seasoning",
        "1 (12 ounce) package fresh green beans"
    ],
    "method": [
        "Step 1: Preheat oven to 425 degrees F (220 degrees C). Grease a large baking sheet with sides.",
        "Step 2: Place chicken quarters on prepared baking sheet. Stir potatoes, olive oil, juice of 1 lemon, basil, oregano, salt, pepper, and lemon herb seasoning together in a large bowl to coat potatoes. Arrange potatoes around chicken on baking sheet. Pour about 3/4 of oil mixture over chicken, reserving remaining oil; drizzle remaining lemon juice over chicken and potatoes.",
        "Step 3: Bake in the preheated oven for about 30 minutes; shake baking sheet to loosen potatoes, then continue baking for 15 minutes. Place green beans in reserved oil mixture; toss to coat. Remove chicken mixture from oven; pour green bean mixture over chicken and potatoes.",
        "Step 4: Return pan to the oven; bake until green beans are tender with a bite, chicken is no longer pink at the bone and juices run clear, about 15 minutes. An instant-read thermometer inserted near the bone should read 165 degrees F (74 degrees C).",
        "Step 5: Browse our collection ofTzatziki Sauce Recipes.",
        "Step 6: Nutrition data for this recipe includes the full amount of herb-seasoned olive oil. The actual amount of oil consumed will vary."
    ],
    "image": "images/greek-lemon-chicken-and-potato-bake.jpg"
}