{
    "title": "Ground Turkey Burritos That Will Fool Your Kids",
    "file_name": "ground-turkey-burritos-that-will-fool-your-kids",
    "url": "https://www.allrecipes.com/recipe/261943/ground-turkey-burritos-that-will-fool-your-kids/",
    "cuisine": "New Zealand",
    "difficulty": "Medium",
    "cooking_time": "40 minutes",
    "country": "New Zealand",
    "continent": "Oceania",
    "metadata": {
        "prep_time": "20 mins",
        "cook_time": "1 hr",
        "total_time": "1 hr 20 mins",
        "active_time": "Unknown",
        "servings": "12",
        "calories": "401 Calories"
    },
    "ingredients": [
        "1 cup uncooked brown rice",
        "water to cover",
        "1 head red cabbage",
        "¼ cup olive oil",
        "1 stalk celery, finely chopped",
        "½  red onion, chopped",
        "1 clove garlic, minced",
        "1 pound ground turkey",
        "sea salt to taste",
        "1 (8 ounce) can crushed tomatoes",
        "12 (10 inch) flour tortillas"
    ],
    "method": [
        "Step 1: Bring brown rice with enough water to cover in a saucepan to a boil. Reduce heat to medium-low, cover, and simmer until rice is tender and liquid has been absorbed, 45 to 50 minutes.",
        "Step 2: Cut off red cabbage stem. Gently peel off leaves, being careful not to tear; place individual leaves into a large pot of water and bring to a boil. Cook for 5 minutes; reduce heat and simmer until tender but still crunchy and red, 8 to 10 minutes more. Drain.",
        "Step 3: Heat olive oil in a large skillet over medium-high heat. Sauté celery, onion, and garlic until softened, 5 to 7 minutes. Mix in turkey; season with salt. Cook and stir until turkey is browned and crumbly, 5 to 7 minutes. Add crushed tomatoes and cooked rice; cook, stirring occasionally, until flavors combine, 10 to 15 minutes.",
        "Step 4: Place 1 cabbage leaf on top of each tortilla. Fill with turkey-rice mixture; fold up bottom end and roll into a tight burrito.",
        "Step 5: Heat a grill pan over medium heat. Cook burritos, in batches, until outsides are crunchy, about 5 minutes, flipping as necessary. Repeat with remaining burritos."
    ],
    "image": "images/ground-turkey-burritos-that-will-fool-your-kids.jpg"
}