{
    "title": "Homemade Mac and Cheese",
    "file_name": "homemade-mac-and-cheese",
    "url": "https://www.allrecipes.com/recipe/11679/homemade-mac-and-cheese/",
    "cuisine": "American",
    "difficulty": "Easy",
    "cooking_time": "30 minutes",
    "country": "United States",
    "continent": "North America",
    "metadata": {
        "prep_time": "10 mins",
        "cook_time": "45 mins",
        "total_time": "55 mins",
        "active_time": "Unknown",
        "servings": "4",
        "calories": "845 Calories"
    },
    "ingredients": [
        "8 ounces uncooked elbow macaroni",
        "¼ cup salted butter",
        "3 tablespoons all-purpose flour",
        "2 ½ cups milk, or more as needed",
        "2 cups shredded sharp Cheddar cheese",
        "½ cup finely grated Parmesan cheese",
        "salt and ground black pepper to taste",
        "2 tablespoons salted butter",
        "½ cup dry bread crumbs",
        "1 pinch ground paprika"
    ],
    "method": [
        "Step 1: Gather all ingredients. Preheat the oven to 350 degrees F (175 degrees C). Grease an 8-inch square baking dish.",
        "Step 2: To make the macaroni and cheese: Bring a large pot of lightly salted water to a boil. Add macaroni and simmer, stirring occasionally, until tender yet firm to the bite, about 8 minutes; it will finish cooking in the oven. Drain and transfer to the prepared baking dish.",
        "Step 3: While the macaroni is cooking, melt 1/4 cup butter in a medium skillet over low heat. Whisk in flour and stir until the mixture becomes paste-like and light golden brown, 3 to 5 minutes.",
        "Step 4: Gradually whisk 2 ½ cups milk into the flour mixture, and bring to a simmer.",
        "Step 5: Stir in shredded Cheddar and finely grated Parmesan cheeses; season with salt and pepper. Cook and stir over low heat until cheese is melted and sauce has thickened, 3 to 5 minutes, adding up to 1/2 cup more milk if needed.",
        "Step 6: Pour cheese sauce over macaroni and stir until well combined.",
        "Step 7: Make the bread crumb topping: Melt 2 tablespoons butter in a skillet over medium heat. Add bread crumbs; cook and stir until well coated and browned.",
        "Step 8: Spread bread crumbs over macaroni and cheese, then sprinkle with paprika.",
        "Step 9: Bake in the preheated oven until topping is golden brown and macaroni and cheese is bubbling, about 30 minutes."
    ],
    "image": "images/homemade-mac-and-cheese.jpg"
}