{
    "title": "Kalam Polo (Persian Cabbage and Rice)",
    "file_name": "kalam-polo-persian-cabbage-and-rice",
    "url": "https://www.allrecipes.com/recipe/279043/kalam-polo-persian-cabbage-and-rice/",
    "cuisine": "Iranian",
    "difficulty": "Medium",
    "cooking_time": "70 minutes",
    "country": "Iran",
    "continent": "Asia",
    "metadata": {
        "prep_time": "15 mins",
        "cook_time": "1 hr 10 mins",
        "total_time": "1 hr 55 mins",
        "active_time": "Unknown",
        "servings": "4",
        "calories": "681 Calories"
    },
    "ingredients": [
        "1 ½ cups boiling water",
        "1 tablespoon saffron",
        "3 tablespoons vegetable oil, divided",
        "½ cup chopped onion",
        "1 pound ground beef",
        "1 teaspoon salt, divided",
        "½ teaspoon ground black pepper",
        "¼ teaspoon ground turmeric",
        "3 cups chopped cabbage",
        "1 teaspoon ground cinnamon",
        "¼ teaspoon ground ginger",
        "2 cups basmati rice",
        "1 ½ cups cold water",
        "1 tablespoon butter",
        "1 cup hot water"
    ],
    "method": [
        "Step 1: Pour boiling water over ground saffron; let sit for 30 minutes. Reserve 1/4 cup for rice; save remaining brewed saffron for another use.",
        "Step 2: Heat 2 tablespoons vegetable oil in a pan over medium-high heat. Sauté onion until light brown, 5 to 7 minutes. Stir in ground beef, 1/2 teaspoon salt, black pepper, and turmeric. Cook and stir until beef is browned and crumbly, 5 to 7 minutes. Cover the pan and cook over low heat for 15 minutes.",
        "Step 3: Heat remaining oil in another pan over medium heat. Sauté cabbage until tender, about 5 minutes. Add cinnamon and ginger. Stir mixture into ground beef mixture and continue to cook over low heat, covered, for 5 minutes, adding 1 tablespoon of water if the mixture is dry.",
        "Step 4: Rinse and drain rice; transfer to a pot. Add cold water, butter, and remaining salt. Bring mixture to a boil, uncovered. Reduce heat to medium-low and simmer until rice is half-cooked and water has evaporated, 10 to 15 minutes. Fluff with a fork.",
        "Step 5: Add beef mixture to the rice and slowly mix to incorporate. Turn the heat to low. Add hot water and reserved 1/4 cup brewed saffron to the rice, cover the pot, and let cook until rice is tender, about 20 minutes."
    ],
    "image": "images/kalam-polo-persian-cabbage-and-rice.jpg"
}