{
    "title": "Lahmacun Turkish Pizza",
    "file_name": "lahmacun-turkish-pizza",
    "url": "https://www.allrecipes.com/recipe/215594/lahmacun-turkish-pizza/",
    "cuisine": "Turkish",
    "difficulty": "Medium",
    "cooking_time": "35 minutes",
    "country": "Turkey",
    "continent": "Europe/Asia",
    "metadata": {
        "prep_time": "2 hrs",
        "cook_time": "20 mins",
        "total_time": "11 hrs 20 mins",
        "active_time": "Unknown",
        "servings": "10",
        "calories": "480 Calories"
    },
    "ingredients": [
        "1  yellow onion, chopped",
        "½ cup chopped fresh parsley",
        "½ cup green bell pepper, diced",
        "½ cup red bell pepper, diced",
        "3 tablespoons chopped fresh basil",
        "2 tablespoons chopped fresh mint",
        "½  lemon, juiced",
        "4 teaspoons olive oil",
        "1 teaspoon chopped garlic",
        "½ teaspoon paprika",
        "½ teaspoon ground coriander seed",
        "½ teaspoon ground cumin",
        "4  Roma (plum) tomatoes, halved",
        "1 pound lean ground lamb",
        "6 tablespoons double concentrated tomato paste",
        "cayenne pepper to taste",
        "salt to taste",
        "3 ¼ teaspoons active dry yeast",
        "½ teaspoon white sugar",
        "1 cup warm water (110 degrees F/45 degrees C)",
        "5 cups all-purpose flour",
        "2 teaspoons salt",
        "½ cup water",
        "¼ cup vegetable oil",
        "1 cup plain yogurt",
        "½ teaspoon chopped fresh parsley",
        "¼ teaspoon crushed garlic",
        "salt and ground black pepper to taste",
        "1 cup shredded green cabbage",
        "1 cup shredded red cabbage"
    ],
    "method": [
        "Step 1: Make lamb sauce: Combine onion, parsley, bell peppers, basil, mint, lemon juice, olive oil, garlic, paprika, coriander seed, and cumin. Pulse until vegetables are finely chopped. Add tomatoes and process until mixture is a thick puree.",
        "Step 2: Heat a large skillet over medium heat. Add lamb, pureed vegetable mixture, and tomato paste; mix well. Cook and stir until lamb is cooked through, 10 to 15 minutes. Stir in cayenne pepper and salt to taste. Transfer mixture to a shallow baking dish to cool to room temperature. Cover with plastic wrap and refrigerate, 8 hours to overnight.",
        "Step 3: Make dough: Dissolve yeast and sugar in 1 cup warm water. Combine flour and salt in a large bowl and stir well. Add 1/2 cup water and oil to yeast mixture and pour over flour mixture. Use your hands to mix dough. Turn dough out onto a lightly floured surface and knead until smooth and elastic, about 8 minutes.",
        "Step 4: Shape dough into a ball and transfer to an oiled bowl. Cover with a wet towel and let rise in a warm place until doubled in bulk, about 1 hour. Remove lamb sauce from the refrigerator and allow to come up to room temperature.",
        "Step 5: Meanwhile, make garlic sauce: Combine yogurt, parsley, and garlic in a small bowl. Season with salt and pepper. Stir well and set aside.",
        "Step 6: Punch dough down, transfer it to a floured work surface, and cut into 10 portions. Shape each portion into a round. Flatten each round with your hand; use a rolling pin to roll each piece into a 10-inch circle. The dough should be thin, like a crepe. Place the rounds on parchment paper.",
        "Step 7: Preheat the oven to 500 degrees F (260 degrees C). Line baking sheets with parchment paper.",
        "Step 8: Stir lamb sauce and spoon it onto a dough round. Spread it thinly to the edges and press down lightly so it sticks. Place on the prepared baking sheets.",
        "Step 9: Bake pizzas on the lowest oven rack in the preheated oven until the edges are a light tan color, 8 to 10 minutes. Place on a wire rack to cool. The pizzas can be stored in an airtight container in the refrigerator for 3 days or in the freezer for 3 months. To reheat, place pizzas in a 350 degrees F oven (175 degrees C) for 8 minutes.",
        "Step 10: Assemble lahmacun: Drizzle pizzas with garlic sauce, top with shredded cabbage, and roll up to eat.",
        "Step 11: Additional condiments include chili sauce, harissa, or Tabasco. In place of the cabbage, you can combine 1 cup lettuce, thinly sliced tomatoes, cucumbers, and red onion.",
        "Step 12: To assemble, arrange cabbage, lettuce, cucumbers, tomatoes, or onion down one side of the pizza. Drizzle with garlic sauce and hot sauce, and roll up. Eat and enjoy, but watch out for the drip. You won't want to miss a bite!",
        "Step 13: If you can't find ground lamb in your area, you may substitute ground beef."
    ],
    "image": "images/lahmacun-turkish-pizza.jpg"
}