{
    "title": "Little Lamb Meatballs in a Spicy Eggplant Tomato Sauce",
    "file_name": "little-lamb-meatballs-in-a-spicy-eggplant-tomato-sauce",
    "url": "https://www.allrecipes.com/recipe/221228/little-lamb-meatballs-in-a-spicy-eggplant-tomato-sauce/",
    "cuisine": "Greek",
    "difficulty": "Medium",
    "cooking_time": "50 minutes",
    "country": "Greece",
    "continent": "Europe",
    "metadata": {
        "prep_time": "25 mins",
        "cook_time": "1 hr 30 mins",
        "total_time": "1 hr 55 mins",
        "active_time": "Unknown",
        "servings": "4",
        "calories": "420 Calories"
    },
    "ingredients": [
        "1  eggplant, cubed",
        "2 tablespoons olive oil",
        "salt and freshly ground black pepper to taste",
        "⅓ cup finely minced onion",
        "1 pinch crushed red pepper flakes, or to taste",
        "1 ½ cups chicken broth",
        "1 cup marinara sauce",
        "¼ cup plain dry bread crumbs",
        "1  large egg",
        "1 ½ tablespoons Greek yogurt",
        "¼ cup finely minced onion",
        "4 cloves garlic, finely minced",
        "1 ½ teaspoons kosher salt",
        "1 teaspoon freshly ground black pepper",
        "1 teaspoon ground cumin",
        "½ teaspoon ground cinnamon",
        "¼ teaspoon ground coriander",
        "1 pound ground lamb",
        "1/4 teaspoon cayenne pepper, or to taste",
        "1 tablespoon chopped fresh mint"
    ],
    "method": [
        "Step 1: Preheat the oven to 450 degrees F (230 degrees C). Line a baking sheet with parchment paper or a silicone baking mat.",
        "Step 2: Combine eggplant, olive oil, salt, and black pepper in a large skillet over medium-high heat. Cook and stir until eggplant begins to soften, about 5 minutes.",
        "Step 3: Mix in 1/3 cup onion and red pepper flakes. Reduce heat to medium; cook and stir until onion is softened, about 4 minutes. Stir in broth and marinara sauce. Reduce heat to medium-low and simmer until sauce mixture has reduced by half, about 30 minutes.",
        "Step 4: Meanwhile, whisk together bread crumbs, egg, and Greek yogurt in a large bowl until bread crumbs absorb all the liquid, about 3 minutes. Mix in 1/4 cup onion, garlic, kosher salt, black pepper, cumin, cinnamon, and coriander until well combined. Crumble in lamb and sprinkle with cayenne pepper; mix well.",
        "Step 5: Form lamb mixture into small meatballs and transfer to the prepared baking sheet.",
        "Step 6: Bake in the preheated oven until browned but still pink inside, about 10 minutes.",
        "Step 7: Remove meatballs from the oven and stir into simmering sauce. Simmer over low heat until sauce begins to thicken and meatballs are cooked through, 30 to 45 minutes. An instant-read thermometer inserted into the center of a meatball should read 160 degrees F (72 degrees C).",
        "Step 8: Garnish meatballs and sauce with mint to serve.",
        "Step 9: You can add more stock or water to the sauce if it becomes dry while simmering."
    ],
    "image": "images/little-lamb-meatballs-in-a-spicy-eggplant-tomato-sauce.jpg"
}