{
    "title": "Maamoul (Lebanese Date Cookies)",
    "file_name": "maamoul-lebanese-date-cookies",
    "url": "https://www.allrecipes.com/recipe/278238/maamoul-lebanese-date-cookies/",
    "cuisine": "Moroccan",
    "difficulty": "Medium",
    "cooking_time": "45 minutes",
    "country": "Morocco",
    "continent": "Africa",
    "metadata": {
        "prep_time": "45 mins",
        "cook_time": "30 mins",
        "total_time": "9 hrs 35 mins",
        "active_time": "Unknown",
        "servings": "48",
        "calories": "57 Calories"
    },
    "ingredients": [
        "2 cups semolina flour",
        "1 cup all-purpose flour",
        "½ teaspoon ground mahlab",
        "½ teaspoon salt",
        "1 cup clarified butter, at room temperature",
        "5 tablespoons milk",
        "2 tablespoons white sugar",
        "1 teaspoon active dry yeast",
        "4 tablespoons orange blossom water, or more as needed",
        "10 tablespoons date paste (such as Ziyad), cut into small pieces",
        "2 tablespoons powdered sugar, or to taste"
    ],
    "method": [
        "Step 1: Mix semolina flour, all-purpose flour, mahlab, and salt together in a large bowl. Work clarified butter into the dry ingredients with your fingertips until thoroughly incorporated. Cover bowl and let dough rest at room temperature, 8 hours to overnight.",
        "Step 2: Pour milk into a microwave-safe bowl. Microwave until just warm, about 15 seconds. Stir in sugar and yeast until dissolved. Let stand until foamy, about 5 minutes.",
        "Step 3: Pour yeast mixture and orange blossom water over the dough and mix until evenly moistened. Pinch off a piece of dough and roll into a ball; it should hold its shape without cracking. Add more milk or orange blossom water if needed. Cover and let rest for 15 minutes.",
        "Step 4: Preheat the oven to 350 degrees F (175 degrees C). Line 2 baking sheets with parchment paper or silicone baking mats.",
        "Step 5: Sprinkle some flour over the ma'amoul molds and tap out the excess. Pinch off a walnut-sized piece of dough and roll into a ball. Press your thumb into the ball to create space for the filling. Work the edges with your fingers so the sides are even and fairly thin. Drop in a piece of date paste and pinch dough over it to seal.",
        "Step 6: Place cookie into the mold cavity seam-side up. Press down so that the top is flush with edges of the mold. Trim off any excess dough. Invert the mold and tap it against your work surface to release the cookie. Repeat with remaining dough and date paste, arranging cookies 1 inch apart on the baking sheets.",
        "Step 7: Bake in the preheated oven, 1 baking sheet at a time, until edges and bottoms are golden but tops are still mostly pale, about 15 minutes.",
        "Step 8: Sift powdered sugar over the cookies while still slightly warm. Let cool completely. Store in an airtight container at room temperature.",
        "Step 9: Learn how to makeclarified butter."
    ],
    "image": "images/maamoul-lebanese-date-cookies.jpg"
}