{
    "title": "Malaysian Flatbread (Roti Canai) with Curried Lentil Dip",
    "file_name": "malaysian-flatbread-roti-canai-with-curried-lentil-dip",
    "url": "https://www.allrecipes.com/recipe/285148/malaysian-flatbread-roti-canai-with-curried-lentil-dip/",
    "cuisine": "Malaysian",
    "difficulty": "Medium",
    "cooking_time": "120 minutes",
    "country": "Malaysia",
    "continent": "Asia",
    "metadata": {
        "prep_time": "30 mins",
        "cook_time": "1 hr 35 mins",
        "total_time": "10 hrs 15 mins",
        "active_time": "Unknown",
        "servings": "8",
        "calories": "565 Calories"
    },
    "ingredients": [
        "4 cups bread flour",
        "2 tablespoons white sugar",
        "1 ½ teaspoons kosher salt",
        "1 large egg, beaten",
        "3 tablespoons unsalted butter, melted",
        "1 ¼ cups water",
        "2 teaspoons vegetable oil",
        "2 tablespoons unsalted butter",
        "½ cup diced yellow onion",
        "2 teaspoons grated fresh ginger",
        "4 cloves garlic, minced",
        "1 ½ teaspoons kosher salt, or more to taste",
        "2 tablespoons curry powder",
        "1 teaspoon ground paprika",
        "1 teaspoon ground cumin",
        "½ teaspoon black pepper",
        "½ teaspoon cayenne pepper",
        "¼ cup tomato paste",
        "3 cups cold water",
        "1 (14 ounce) can full-fat coconut milk",
        "1 cup dried red lentils",
        "¼ cup unsalted butter, melted, or more as needed",
        "2 tablespoons chopped fresh cilantro",
        "1 tablespoon finely chopped serrano pepper"
    ],
    "method": [
        "Step 1: Combine bread flour, sugar, kosher salt, egg, melted butter, and water for roti canai in a mixing bowl. Mix with your hands until a shaggy dough forms. Transfer to a work surface and knead until a smooth, elastic dough forms, about 7 minutes.",
        "Step 2: Divide dough into 8 equal pieces and form each one into a ball. Coat each ball with vegetable oil, transfer to a plate, and cover with plastic wrap. Refrigerate for 8 hours, to overnight.",
        "Step 3: Melt butter for dip in a saucepan over medium-high heat. Add onion, ginger, garlic, kosher salt, curry powder, paprika, cumin, black pepper, and cayenne pepper; stir together and saute until onion has softened and spices are fragrant, 3 to 4 minutes. Stir in tomato paste and cook until it starts to toast and caramelize on the bottom of the pan, about 3 minutes.",
        "Step 4: Stir in cold water and coconut milk. Add lentils; stir and bring to a simmer. Reduce heat to medium-low and simmer, stirring occasionally, until tender, about 40 minutes. Taste and adjust seasonings. Reduce heat to low and keep warm while you prepare the roti canai.",
        "Step 5: Place 1/4 cup melted butter in a bowl. Transfer rested dough balls onto a lightly oiled work surface. Flatten each ball slightly and rub a little melted butter on top. Cover dough with plastic wrap and let it warm up slightly, about 10 minutes.",
        "Step 6: Press on top of the plastic wrap to flatten warmed dough. Remove plastic wrap and add a bit more butter. Stretch each piece from the center out to get it as thin as possible (until almost see-through), adding more butter as needed. Don't worry if there are a few small tears.",
        "Step 7: Sprinkle on more melted butter, then pull two sides in towards the center until touching and overlapping slightly. Pull the other two edges in the same way to form a square. Cover with plastic wrap and flatten roti canai one more time.",
        "Step 8: Add some melted butter to a skillet set over medium or medium-low heat. Add roti canai and cook until browned, flaky, and crispy on the outside and fully cooked through on the inside, 3 to 4 minutes per side.",
        "Step 9: Remove from the skillet and smush it with your hands to fluff it up and separate the layers of dough. Repeat to cook remaining roti canai.",
        "Step 10: Sprinkle the curried red lentil dip with cilantro and sliced serrano peppers and serve alongside the roti canai.",
        "Step 11: You can use 1 teaspoon fine salt in place of 1 1/2 teaspoons kosher salt for the roti canai. You can use any lentils in place of red lentils."
    ],
    "image": "images/malaysian-flatbread-roti-canai-with-curried-lentil-dip.jpg"
}