{
    "title": "Mbeju (Paraguayan Cheese Flatbread)",
    "file_name": "mbeju-paraguayan-cheese-flatbread",
    "url": "https://www.allrecipes.com/recipe/279730/mbeju-paraguayan-cheese-flatbread/",
    "cuisine": "Indonesian",
    "difficulty": "Easy",
    "cooking_time": "40 minutes",
    "country": "Indonesia",
    "continent": "Asia",
    "metadata": {
        "prep_time": "10 mins",
        "cook_time": "25 mins",
        "total_time": "35 mins",
        "active_time": "Unknown",
        "servings": "6",
        "calories": "311 Calories"
    },
    "ingredients": [
        "2 cups cassava flour",
        "½ teaspoon kosher salt",
        "1 pinch cayenne pepper",
        "4 tablespoons cold butter, cut into cubes",
        "4 ounces freshly grated mild Cheddar cheese",
        "⅓ cup cold milk, or more as needed"
    ],
    "method": [
        "Step 1: Combine cassava flour, salt, cayenne, butter, and Cheddar cheese in a large bowl by rubbing the mixture between your fingertips until it resembles large, coarse crumbs. Drizzle in milk and continue mixing and rubbing with your hands until the mixture resembles very small pebbles and is moist enough to hold together in large clumps when squeezed tightly together; add more milk if needed.",
        "Step 2: Place a small (6-inch) dry, nonstick pan over medium-high heat until hot, about 2 minutes. Transfer in a heaping 1/2 cup cassava mixture or enough to cover the bottom of the pan. The mixture should be 1/4 inch to 1/2 inch deep. Press the top of the mixture down slightly to settle and use a spatula to go around the edges of the mixture, pressing any loose crumbs back into the flatbread.",
        "Step 3: Cover and cook until the bottom is golden brown, a crust forms under the flatbread, and a spatula can be slid underneath, about 3 minutes. Turn over with a combination of tossing the pan up slightly while flipping with the spatula. You can also place a plate over the pan, then invert the flatbread and slide it back into the pan. Cook the other side until golden brown, 3 to 4 minutes more. Remove from heat and let rest for 2 minutes before serving warm."
    ],
    "image": "images/mbeju-paraguayan-cheese-flatbread.jpg"
}