{
    "title": "Mediterranean Meat Pies (Sfeeha)",
    "file_name": "mediterranean-meat-pies-sfeeha",
    "url": "https://www.allrecipes.com/recipe/216879/mediterranean-meat-pies-sfeeha/",
    "cuisine": "Lebanese",
    "difficulty": "Medium",
    "cooking_time": "70 minutes",
    "country": "Lebanon",
    "continent": "Asia",
    "metadata": {
        "prep_time": "20 mins",
        "cook_time": "15 mins",
        "total_time": "1 hr 20 mins",
        "active_time": "Unknown",
        "servings": "18",
        "calories": "412 Calories"
    },
    "ingredients": [
        "1 pound ground beef",
        "½ pound ground lamb",
        "1  white onion, finely chopped",
        "¾ cup pine nuts",
        "⅛ teaspoon ground cinnamon",
        "salt and ground black pepper to taste",
        "⅓ cup lemon juice",
        "2 (17.3 ounce) packages frozen puff pastry, thawed",
        "1  egg, beaten"
    ],
    "method": [
        "Step 1: Heat a large skillet over medium-high heat. Stir in ground beef, ground lamb, onion, pine nuts, cinnamon, and salt and black pepper. Cook and stir until meat is crumbly, evenly browned, and no longer pink. Drain and discard any excess grease.",
        "Step 2: Stir in lemon juice. Taste and adjust the seasonings. Let the meat mixture cool.",
        "Step 3: Preheat the oven to 350 degrees F (175 degrees C). Lightly grease a baking sheet or line it with parchment paper.",
        "Step 4: Roll out thawed pastry sheets to about 1/8 inch thick. Using a sharp 3-inch round cookie cutter, cut out at least 9 rounds per sheet. Lightly brush the inside edges with a little water, and place about 2 teaspoons of filling into the middle of each round. Fold the pastry round in half to cover the filling and seal the edges well. Transfer to the prepared baking sheet and repeat with the remaining dough circles.",
        "Step 5: Brush each pie with a little egg wash. Bake in the preheated oven until golden brown, 15 to 20 minutes.",
        "Step 6: For following halal rules, look for puff pastry dough that isn't made with lard."
    ],
    "image": "images/mediterranean-meat-pies-sfeeha.jpg"
}