{
    "title": "Old-Fashioned Apple Dumplings",
    "file_name": "old-fashioned-apple-dumplings",
    "url": "https://www.allrecipes.com/recipe/46232/old-fashioned-apple-dumplings/",
    "cuisine": "Greek",
    "difficulty": "Easy",
    "cooking_time": "30 minutes",
    "country": "Greece",
    "continent": "Europe",
    "metadata": {
        "prep_time": "30 mins",
        "cook_time": "1 hr",
        "total_time": "1 hr 30 mins",
        "active_time": "Unknown",
        "servings": "6",
        "calories": "899 Calories"
    },
    "ingredients": [
        "1 (14.1 ounce) double-crust pie pastry, thawed",
        "6 large Granny Smith apples, peeled and cored",
        "½ cup butter",
        "¾ cup brown sugar",
        "1 teaspoon ground cinnamon",
        "½ teaspoon ground nutmeg",
        "3 cups water",
        "2 cups white sugar",
        "1 teaspoon vanilla extract"
    ],
    "method": [
        "Step 1: Gather all ingredients. Preheat the oven to 400 degrees F (200 degrees C). Butter a 9x13-inch pan.",
        "Step 2: Roll pastry into a 24x16-inch rectangle on a lightly floured surface. Cut into six 8-inch squares. Place an apple on each pastry square with the cored opening facing upward.",
        "Step 3: Cut butter into 8 pieces; place 1 piece in the opening of each apple; reserve the remaining butter for sauce.",
        "Step 4: Divide brown sugar between apples, poking some inside each cored opening and the rest around the base of each apple. Sprinkle cinnamon and nutmeg over apples.",
        "Step 5: Using slightly wet fingertips, bring one corner of the pastry square up to the top of the apple, then bring the opposite corner to the top and press together. Bring up the two remaining corners, and seal. Slightly pinch the dough at the sides to completely seal in the apple. Repeat with the remaining apples and place in the prepared baking dish.",
        "Step 6: To make the sauce: Combine water, white sugar, vanilla extract, and reserved butter in a large saucepan. Place over medium heat, and bring to a boil. Reduce the heat to low and simmer until sugar is dissolved, about 5 minutes.",
        "Step 7: Carefully pour the sauce over dumplings.",
        "Step 8: Bake in the preheated oven until golden brown and crisp on top, about 50 to 60 minutes.",
        "Step 9: Place each apple dumpling in a dessert bowl, and spoon some of the sauce over the top."
    ],
    "image": "images/old-fashioned-apple-dumplings.jpg"
}