{
    "title": "Pressure Cooker Paella with Chicken Thighs and Smoked Sausage",
    "file_name": "pressure-cooker-paella-with-chicken-thighs-and-smoked-sausage",
    "url": "https://www.allrecipes.com/recipe/268087/pressure-cooker-paella-with-chicken-thighs-and-smoked-sausage/",
    "cuisine": "Spanish",
    "difficulty": "Easy",
    "cooking_time": "10 minutes",
    "country": "Spain",
    "continent": "Europe",
    "metadata": {
        "prep_time": "15 mins",
        "cook_time": "40 mins",
        "total_time": "1 hr 5 mins",
        "active_time": "Unknown",
        "servings": "6",
        "calories": "494 Calories"
    },
    "ingredients": [
        "2 tablespoons olive oil",
        "4  bone-in, skin-on chicken thighs",
        "salt to taste",
        "6 ounces smoked sausage, diced",
        "1 medium sweet onion (such as Vidalia), diced",
        "1  red bell pepper, chopped",
        "3 cloves garlic, minced",
        "1 ½ cups medium-grain white rice",
        "1 ½ teaspoons smoked paprika",
        "1 ½ teaspoons ground turmeric",
        "1 pinch cayenne pepper",
        "1 pinch saffron (Optional)",
        "¼ cup dry sherry",
        "2 ¾ cups chicken broth",
        "1 (10 ounce) can diced tomatoes",
        "½ cup frozen peas"
    ],
    "method": [
        "Step 1: Turn on a multi-functional pressure cooker (such as Instant Pot) and select Sauté function. Add olive oil to the pot and heat for 1 to 2 minutes.",
        "Step 2: Season chicken thighs with salt. Place chicken, skin-side down, in the hot oil. Cook until skin is golden, 4 to 6 minutes. Slide a spatula underneath several times to prevent skin from sticking to the pot. Turn and cook until other side is lightly browned, 2 to 3 minutes. Remove chicken thighs to a plate.",
        "Step 3: Add sausage, onion, and bell pepper to the pot. Sauté until onion is softened, about 3 minutes. Stir in garlic and cook until fragrant, about 1 minute. Add rice, paprika, turmeric, cayenne, and saffron. Stir constantly until spices are aromatic and rice becomes translucent and shiny.",
        "Step 4: Pour in sherry and cook until absorbed, about 1 minute. Pour in chicken broth and use a wooden spoon to scrape any browned bits off the bottom of the pot. Turn off Sauté setting and place chicken thighs over rice. Turn the pressure regulator to the sealing position; select Manual and set cooking time for 12 minutes at high pressure. Allow 10 to 15 minutes for pressure to build.",
        "Step 5: Release pressure using the natural-release method for 10 minutes according to manufacturer's instructions. Turn the pressure regulator to 'venting' and release remaining pressure. Remove the lid, transfer chicken thighs to a clean plate, and pour in tomatoes and peas. Mix well.",
        "Step 6: Switch to Sauté mode and cook until liquid is mostly evaporated, 3 to 5 minutes. Top each serving of rice with a chicken thigh."
    ],
    "image": "images/pressure-cooker-paella-with-chicken-thighs-and-smoked-sausage.jpg"
}