{
    "title": "Ronto Wrap",
    "file_name": "ronto-wrap",
    "url": "https://www.allrecipes.com/ronto-wrap-recipe-8604081",
    "cuisine": "Greek",
    "difficulty": "Medium",
    "cooking_time": "90 minutes",
    "country": "Greece",
    "continent": "Europe",
    "metadata": {
        "prep_time": "15 mins",
        "cook_time": "25 mins",
        "total_time": "40 mins",
        "active_time": "Unknown",
        "servings": "4",
        "calories": "832 Calories"
    },
    "ingredients": [
        "1 pound pork tenderloin,",
        "1 tablespoon olive oil",
        "1  garlic clove",
        "1/4 teaspoon red pepper flakes",
        "pinch cayenne",
        "pinch of cumin",
        "kosher salt",
        "4  pork sausages",
        "1 12ounce) coleslaw mix",
        "2 tablespoons fresh cilantro",
        "2 tablespoons apple cider vinegar",
        "1 tablespoon jalapeno pepper",
        "1  lime, juiced",
        "1/2 teaspoon black pepper",
        "1/2 teaspoon osher salt",
        "1/2 cup mayonnaise",
        "1/4 cup reek yogurt",
        "1  lemon, juiced",
        "1 teaspoon prepared horseradish",
        "1 teaspoon orcestershire sauce",
        "2 teaspoons peppercorns",
        "Kosher salt to taste",
        "4  pita or naan, warmed"
    ],
    "method": [
        "Step 1: Preheat the oven to 400 degrees F (200 degrees C).",
        "Step 2: Place the trimmed pork tenderloin on a plate or work surface. Combine olive oil, grated garlic, red pepper flakes, cayenne, and cumin in a small bowl. Rub the oil and spice mixture all over the pork, coating the entire surface, then season generously with Kosher salt.",
        "Step 3: Preheat a coated cast-iron skillet over medium-high heat, about 2 minutes. Add pork tenderloin and cook until deeply golden brown, about 5 minutes. Flip tenderloin over and cook for an additional 3 minutes. Transfer skillet to the preheated oven and roast for 5 minutes. Remove from the oven, push tenderloin to one side of the skillet and add the sausages. Roast for an additional 10 minutes, flipping sausages halfway through, until the pork reaches an internal temperature of 145 degrees F (62 degrees C). Remove skillet from the oven and tent with foil to rest for at least 10 minutes.",
        "Step 4: Meanwhile, combine coleslaw mix, cilantro, apple cider vinegar, jalapeño, lime juice, freshly ground black pepper, and salt in a bowl. Use tongs to toss the slaw so everything is evenly mixed.",
        "Step 5: Combine mayonnaise, Greek yogurt, lemon juice, horseradish, Worcestershire sauce, pepper, and kosher salt in a small bowl for the peppercorn sauce. Taste and adjust the seasoning according to your tastes.",
        "Step 6: When ready to assemble, wrap the pita or naan in foil and place in the oven while you carve the pork to warm slightly. The oven does not need to be on, the residual heat from roasting the pork will be enough to warm the bread.",
        "Step 7: Split the sausages down the center lengthwise. Carve the pork tenderloin into 1/4-inch thick slices.",
        "Step 8: To assemble, place a warm piece of pita or naan on a large plate. Set down 4 to 5 slices of pork tenderloin, and add a sausage on top. place about 1 loosely packed cup of the prepared slaw on top, then drizzle without about 2 tablespoons of peppercorn sauce. Roll the wrap up and enjoy."
    ],
    "image": "images/ronto-wrap.jpg"
}