{
    "title": "Sausage, Egg, and Cheese Breakfast Pastries",
    "file_name": "sausage-egg-and-cheese-breakfast-pastries",
    "url": "https://www.allrecipes.com/sausage-egg-and-cheese-breakfast-pastries-recipe-7965618",
    "cuisine": "Argentinian",
    "difficulty": "Medium",
    "cooking_time": "50 minutes",
    "country": "Argentina",
    "continent": "South America",
    "metadata": {
        "prep_time": "20 mins",
        "cook_time": "20 mins",
        "total_time": "40 mins",
        "active_time": "Unknown",
        "servings": "12",
        "calories": "364 Calories"
    },
    "ingredients": [
        "8 ounces smoked sausage, sliced into 12 1-inch pieces",
        "5 large eggs, divided",
        "1 tablespoon water",
        "1/2 teaspoon kosher salt",
        "1/4 teaspoon ground black pepper",
        "1 tablespoon butter",
        "1 cup shredded Cheddar cheese",
        "1 (17.3 ounce package) puff pastry",
        "1 tablespoon everything bagel seasoning"
    ],
    "method": [
        "Step 1: Gather the ingredients. Preheat the oven to 400 degrees F (200 degrees F).",
        "Step 2: Heat a skillet over medium-high heat. Add sausage pieces and cook until browned on both sides and heated throughout according to package direction, about 3 minutes. Set aside while eggs are prepared.",
        "Step 3: Add 4 eggs to a medium bowl and whisk together with water, salt, and pepper until well mixed.",
        "Step 4: Melt butter a small nonstick skillet set over medium low heat. Add eggs and cook until they are soft scrambled,  stirring often until barely set and creamy.",
        "Step 5: Unfold 1 pastry sheet onto a lightly floured surface and roll out slightly up and down. Place about 1 tablespoons of scrambled eggs onto the pastry sheet 3 across and 4 going down.",
        "Step 6: Divide cheese among the 12 egg portions and top each with a piece of sausage. Lightly brush water around the edges and in between each row of mixture.",
        "Step 7: Roll out the second pastry sheet slightly larger than the first one and loosely place on top.",
        "Step 8: Work the pastry down to seal over each sausage and egg portion and then cut the stuffed pastry into squares using a pizza cutter or knife.",
        "Step 9: Press each square around the edges to make sure they are sealed. Place squares on a parchment lined baking sheet.",
        "Step 10: Lightly beat the remaining egg, brush each square lightly with the beaten egg and sprinkle them evenly with bagel seasoning.",
        "Step 11: Bake in the preheated oven until puffed and golden brown, 15 to 18 minutes."
    ],
    "image": "images/sausage-egg-and-cheese-breakfast-pastries.jpg"
}