{
    "title": "Skordalia (Greek Garlic Potato Dip)",
    "file_name": "skordalia-greek-garlic-potato-dip",
    "url": "https://www.allrecipes.com/recipe/281330/skordalia-greek-garlic-potato-dip/",
    "cuisine": "Lebanese",
    "difficulty": "Easy",
    "cooking_time": "20 minutes",
    "country": "Lebanon",
    "continent": "Asia",
    "metadata": {
        "prep_time": "20 mins",
        "cook_time": "20 mins",
        "total_time": "45 mins",
        "active_time": "Unknown",
        "servings": "8",
        "calories": "183 Calories"
    },
    "ingredients": [
        "1 ¼ pounds russet potatoes",
        "6 cloves garlic, sliced, or to taste",
        "1 teaspoon kosher salt, or more to taste",
        "½  lemon, juiced",
        "¼ cup white wine vinegar",
        "½ cup olive oil",
        "1 pinch cayenne pepper",
        "1 drizzle olive oil, or to taste",
        "1 pinch minced fresh oregano"
    ],
    "method": [
        "Step 1: Peel and quarter the potatoes and add to a saucepan with enough cold salted water to cover by 1 inch. Place over medium-high heat; bring to a simmer. Reduce heat to medium and continue to simmer until potatoes are tender, but not falling apart, 15 to 20 minutes.",
        "Step 2: While potatoes are cooking, add garlic and 1 teaspoon kosher salt to a mortar and pestle. Crush into a fine paste and reserve.",
        "Step 3: Drain potatoes, reserving some of the cooking water to thin the dip out with later if desired. Let sit for 5 minutes.",
        "Step 4: Transfer the potatoes to a mixing bowl. Mash with a potato masher or potato ricer until smooth and lump free. Stir in garlic paste. Add lemon juice and vinegar and stir in with the masher.",
        "Step 5: Whisk in 1/2 cup olive oil in 3 or 4 additions. Add cayenne and more salt if needed. Pass dip through a mesh strainer into a bowl. Serve at room temperature, garnished with olive oil and oregano.",
        "Step 6: You can make this with whatever kind of potato you want, but I highly recommend using a russet.",
        "Step 7: You can add fresh herbs to this if you like, such as parsley, chives, or dried oregano.",
        "Step 8: I prefer using a milder, fruity olive oil for this. Dip may be thinned with potato cooking water if needed, depending on the desired thickness; just reserve before draining."
    ],
    "image": "images/skordalia-greek-garlic-potato-dip.jpg"
}