{
    "title": "Spanish-Style French Toast (Torrijas)",
    "file_name": "spanish-style-french-toast-torrijas",
    "url": "https://www.allrecipes.com/spanish-style-french-toast-torrijas-recipe-8735953",
    "cuisine": "Spanish",
    "difficulty": "Medium",
    "cooking_time": "25 minutes",
    "country": "Spain",
    "continent": "Europe",
    "metadata": {
        "prep_time": "20 mins",
        "cook_time": "20 mins",
        "total_time": "40 mins",
        "active_time": "Unknown",
        "servings": "4",
        "calories": "874 Calories"
    },
    "ingredients": [
        "4 cups milk",
        "1/2 cup white sugar",
        "1/4 teaspoon salt",
        "1  orange, zested",
        "1  lemon, zested",
        "1 teaspoon cinnamon",
        "2  whole cloves",
        "1 1/2 teaspoons vanilla extract",
        "3 large egg yolks",
        "2 large whole eggs",
        "4 slices French bread or brioche",
        "1 cup olive oil, or as needed, for frying",
        "4 tablespoons turbinado sugar (raw sugar)"
    ],
    "method": [
        "Step 1: Combine milk, white sugar, salt, orange zest, lemon zest, cinnamon, cloves, and vanilla in a saucepan, whisk, and bring to a simmer over medium-heat. Reduce heat to medium-low and simmer gently for 5 minutes.",
        "Step 2: Strain milk through a mesh strainer and transfer 2 cups into a shallow dish in which to soak stale bread; set aside.",
        "Step 3: Transfer remaining 2 cups infused milk into a saucepan to make the custard sauce; add yolks and whisk thoroughly. Return saucepan to medium-low heat, and cook, stirring with a spatula and scraping the bottom constantly, until the mixture gets hot and thickens enough to coat the back of a spoon. Remove from heat; immediately pour through a fine mesh strainer. Let cool and refrigerate until needed.",
        "Step 4: Soak stale bread in milk, turning a few times, until most of milk is absorbed and bread is saturated. Remove to a pan or plate and refrigerate until needed.",
        "Step 5: Beat whole eggs in a wide shallow bowl. Coat bread on both sides in the egg.",
        "Step 6: Pour olive oil, 1/4  to 1/2 inch deep into a nonstick skillet, and heat over medium heat. Fry soaked bread in the hot oil until browned and puffed, about 4 minutes per side. When fully cooked, the bread will spring back when touched in the center.",
        "Step 7: Remove to a plate. Top each slice with 1 tablespoon turbinado sugar. Use a blowtorch with a low flame to brûlée the surface. Serve immediately with custard sauce."
    ],
    "image": "images/spanish-style-french-toast-torrijas.jpg"
}