{
    "title": "Spanish Chorizo Stuffed Chicken Breast",
    "file_name": "spanish-chorizo-stuffed-chicken-breast",
    "url": "https://www.allrecipes.com/spanish-chorizo-stuffed-chicken-breast-recipe-7965161",
    "cuisine": "Spanish",
    "difficulty": "Medium",
    "cooking_time": "45 minutes",
    "country": "Spain",
    "continent": "Europe",
    "metadata": {
        "prep_time": "20 mins",
        "cook_time": "30 mins",
        "total_time": "50 mins",
        "active_time": "Unknown",
        "servings": "2",
        "calories": "628 Calories"
    },
    "ingredients": [
        "2 tablespoons olive oil",
        "2  cloves garlic, crushed",
        "1 teaspoon fresh oregano (optional)",
        "2 large boneless skinless chicken breasts (8 to 10 ounces each)",
        "2 ounces chorizo sausage, thinly sliced",
        "salt to taste",
        "2 tablespoons fine breadcrumbs",
        "2 tablespoons armigiano-Reggiano cheese",
        "2 tablespoons sherry vinegar",
        "1/3 cup sherry wine",
        "2 tablespoons butter, cubed",
        "black pepper to taste",
        "1 tablespoon talian parsley (optional)"
    ],
    "method": [
        "Step 1: Mix olive oil, garlic, and oregano in a small bowl and setaside.",
        "Step 2: Preheat the oven to 475 degrees F (245 degrees C).",
        "Step 3: Use a sharp thin knife to make five deep slashes at a 45-degree angle into the chicken breast, about an inch apart, going almost, but not quite all the way through.  Leave about 1/2-inch of breast un-cut on either side of the slash.",
        "Step 4: Salt chicken breasts generously on both sides, and spoon oil mixture on top. Rub olive oil mixture into slashes, and all over the surface and bottom of the breasts.",
        "Step 5: Slide slices of chorizo into the slashes in the chicken. Once inserted, at least 75% of the sausage slice should be covered by chicken.",
        "Step 6: Transfer chicken to an oven safe skillet or pan, and pour over any extra oil. Dust breasts with breadcrumbs, and sprinkle with cheese.",
        "Step 7: Roast in the preheated oven until chicken is cooked through, 20 to 25 minutes. An instant-read thermometer inserted into the center should read 150 degrees F (65 degrees C).",
        "Step 8: Remove chicken from pan, and let rest on plate, loosely covered with foil.",
        "Step 9: Add vinegar and sherry to the pan and turn the heat to medium high. Season with salt and pepper and bring to a boil, stirring occasionally. Cook until sauce has reduced by half.",
        "Step 10: Add any accumulated juices from the plate of chicken to the pan. Reduce heat to lowest setting and stir in cold butter. Stir constantly until butter has disappeared.",
        "Step 11: Turn off heat, and stir in the parsley. Taste for seasoning and adjust if necessary.",
        "Step 12: Transfer chicken to plates and top with sauce."
    ],
    "image": "images/spanish-chorizo-stuffed-chicken-breast.jpg"
}