{
    "title": "Strawberry Freezer Jam",
    "file_name": "strawberry-freezer-jam",
    "url": "https://www.allrecipes.com/recipe/51835/strawberry-freezer-jam/",
    "cuisine": "Indian",
    "difficulty": "Easy",
    "cooking_time": "15 minutes",
    "country": "India",
    "continent": "Asia",
    "metadata": {
        "prep_time": "10 mins",
        "cook_time": "10 mins",
        "total_time": "1 day 30 mins",
        "active_time": "Unknown",
        "servings": "32",
        "calories": "41 Calories"
    },
    "ingredients": [
        "4 cups halved fresh strawberries",
        "1 ½ cups granulated sugar",
        "1 (1.75 ounce) package dry pectin",
        "¼ cup water"
    ],
    "method": [
        "Step 1: Gather all ingredients.",
        "Step 2: Crush strawberries using a potato masher in a large bowl. (Alternatively, pulse strawberries in a food processor until just finely chopped but not pureed.) Drain strawberries through a fine mesh strainer; reserve juice for another use. Transfer 2 cups crushed strawberries to a large bowl (reserve any extra strawberries for another use); add sugar, and stir until evenly combined. Let stand at room temperature for 10 minutes, stirring occasionally.",
        "Step 3: Meanwhile, stir pectin and water together in a small saucepan until combined. Bring to a boil over medium-high heat; boil, stirring constantly, until a thick paste forms and pectin is fully dissolved, about 2 minutes.",
        "Step 4: Stir boiling pectin-water mixture into strawberry mixture in large bowl; stir constantly for 3 minutes. To check if jam is set, coat back of a spoon with jam; run a finger through it. If jam remains separated, it is properly set. If jam runs back together, it is not set; stir until set, 3 more minutes. Pour into 2 sterilized pint-size jars or other storage containers, leaving a 1/2-inch space at the top to allow for expansion. Place tops on containers, and leave at room temperature for 24 hours.",
        "Step 5: Place in refrigerator for at least 1 hour before serving, or freeze until ready to use or up to 3 months. Enjoy!"
    ],
    "image": "images/strawberry-freezer-jam.jpg"
}