{
    "title": "Stuffed Red Pepper with Quinoa and Chickpeas",
    "file_name": "stuffed-red-pepper-with-quinoa-and-chickpeas",
    "url": "https://www.allrecipes.com/recipe/233365/stuffed-red-pepper-with-quinoa-and-chickpeas/",
    "cuisine": "Peruvian",
    "difficulty": "Medium",
    "cooking_time": "70 minutes",
    "country": "Peru",
    "continent": "South America",
    "metadata": {
        "prep_time": "15 mins",
        "cook_time": "45 mins",
        "total_time": "1 hr",
        "active_time": "Unknown",
        "servings": "4",
        "calories": "469 Calories"
    },
    "ingredients": [
        "1 teaspoon olive oil, or as needed",
        "1 ⅓ cups water",
        "⅔ cup quinoa",
        "1 (16 ounce) can garbanzo beans (chickpeas), drained and rinsed",
        "1 (16 ounce) can stewed tomatoes (such as Del Monte® Stewed Tomatoes with Onions, Celery, and Green Peppers)",
        "¼ cup walnut pieces",
        "½ cup golden raisins",
        "1 bunch green onions, sliced, white parts and tops separated",
        "½  lemon, juiced",
        "½ teaspoon chili powder",
        "¼ teaspoon garlic powder",
        "¼ teaspoon dried mint leaves",
        "1 pinch ground cinnamon",
        "2 large red bell peppers, halved lengthwise, seeds and membrane removed",
        "¼ cup crumbled goat cheese"
    ],
    "method": [
        "Step 1: Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13-inch baking dish with olive oil.",
        "Step 2: Bring water and quinoa to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until quinoa is tender and water has been absorbed, 15 to 20 minutes.",
        "Step 3: Mix garbanzo beans, stewed tomatoes, walnuts, raisins, white parts of green onions, lemon juice, chili powder, garlic powder, mint, and cinnamon together in a bowl; stir in cooked quinoa.",
        "Step 4: Arrange red bell pepper halves, hollow-side facing upwards, in the prepared baking sheet. Spoon quinoa mixture into each red bell pepper half.",
        "Step 5: Bake in the preheated oven until bell peppers are tender, about 30 minutes. Spoon a few teaspoons of drippings from the bottom of the baking dish over each stuffed pepper; top each with 1 tablespoon goat cheese and green parts of green onions."
    ],
    "image": "images/stuffed-red-pepper-with-quinoa-and-chickpeas.jpg"
}