{
    "title": "Sweet Chili Lime Chicken with Cilantro Couscous",
    "file_name": "sweet-chili-lime-chicken-with-cilantro-couscous",
    "url": "https://www.allrecipes.com/recipe/230735/sweet-chili-lime-chicken-with-cilantro-couscous/",
    "cuisine": "Israeli",
    "difficulty": "Easy",
    "cooking_time": "25 minutes",
    "country": "Israel",
    "continent": "Asia",
    "metadata": {
        "prep_time": "15 mins",
        "cook_time": "15 mins",
        "total_time": "35 mins",
        "active_time": "Unknown",
        "servings": "4",
        "calories": "380 Calories"
    },
    "ingredients": [
        "1 tablespoon olive oil",
        "1 pound skinless, boneless chicken breasts, cubed",
        "1 pinch monosodium glutamate (such as Ac'cent), or to taste",
        "6 tablespoons soy sauce",
        "6 tablespoons brown sugar",
        "1  lime, zested and juiced",
        "½ teaspoon red pepper flakes, or more to taste",
        "2 cups vegetable broth",
        "1 cup couscous",
        "⅓ cup chopped cilantro",
        "4  lime wedges"
    ],
    "method": [
        "Step 1: Heat olive oil in a large skillet over medium heat. Add cubed chicken; cook and stir until juices run clear and chicken is no longer pink inside, 5 to 6 minutes. Sprinkle with monosodium glutamate as chicken cooks; transfer to a plate.",
        "Step 2: Combine soy sauce, brown sugar, zest of 1 lime, juice of 1 lime, and red pepper flakes in a bowl, stirring until sugar dissolved; add to hot skillet. Bring to a boil, then reduce heat to low. Simmer, stirring occasionally, until sauce begins to reduce slightly, 3 to 4 minutes. Stir chicken into sauce; cook until sauce glazes chicken, about 2 to 3 minutes, stirring often.",
        "Step 3: Bring vegetable broth to a boil in a saucepan. Stir in couscous, turn off the heat, and let couscous stand until broth is absorbed, about 5 minutes. Stir in cilantro.",
        "Step 4: Arrange couscous on a serving platter; top with chicken and sauce. Squeeze lime wedges over couscous and chicken before serving."
    ],
    "image": "images/sweet-chili-lime-chicken-with-cilantro-couscous.jpg"
}