{
    "title": "Sweet Sticky Rice with Mangoes",
    "file_name": "sweet-sticky-rice-with-mangoes",
    "url": "https://www.allrecipes.com/recipe/219490/sweet-sticky-rice-with-mangoes/",
    "cuisine": "Thai",
    "difficulty": "Medium",
    "cooking_time": "30 minutes",
    "country": "Thailand",
    "continent": "Asia",
    "metadata": {
        "prep_time": "15 mins",
        "cook_time": "20 mins",
        "total_time": "1 hr 35 mins",
        "active_time": "Unknown",
        "servings": "6",
        "calories": "525 Calories"
    },
    "ingredients": [
        "2 cups uncooked glutinous (sticky) white rice, rinsed",
        "1 (13.5 ounce) can coconut milk, divided",
        "1 cup white sugar",
        "1 tablespoon white sugar",
        "¾ teaspoon cornstarch",
        "¼ teaspoon salt",
        "2  ripe mangoes, peeled and cubed"
    ],
    "method": [
        "Step 1: Cover rice with several inches of fresh water in a microwave-safe bowl; let stand for 30 minutes. Drain off water so rice is covered by 1/4 inch of water.",
        "Step 2: Microwave rice, covered, on High until water is mostly absorbed but rice is still wet, about 10 minutes; stir and cook until almost dry, 4 minutes more.",
        "Step 3: Combine 1/2 coconut milk and 1 cup sugar in a bowl, stirring until sugar dissolved. Pour over rice; stir until rice coated. Cover and let rice stand at room temperature for 20 minutes.",
        "Step 4: Pour remaining 1/2 can coconut milk into a saucepan; whisk in remaining 1 tablespoon sugar, cornstarch, and salt until smooth. Bring mixture to a simmer over medium heat, whisking constantly; simmer until thickened, about 2 minutes. Remove from heat; cool.",
        "Step 5: Scoop rice into individual serving bowls; top each serving with about 2 tablespoons coconut sauce and several mango pieces.",
        "Step 6: You can also steam the sweet rice using the traditional method.",
        "Step 7: You may want to leave the salt out and taste the sauce before you add any."
    ],
    "image": "images/sweet-sticky-rice-with-mangoes.jpg"
}