{
    "title": "Tarte Flambé (Alsatian Bacon and Onion Tart)",
    "file_name": "tarte-flambé-alsatian-bacon-and-onion-tart",
    "url": "https://www.allrecipes.com/recipe/256547/tarte-flambee-alsatian-bacon-onion-tart/",
    "cuisine": "French",
    "difficulty": "Medium",
    "cooking_time": "50 minutes",
    "country": "France",
    "continent": "Europe",
    "metadata": {
        "prep_time": "15 mins",
        "cook_time": "25 mins",
        "total_time": "40 mins",
        "active_time": "Unknown",
        "servings": "4",
        "calories": "657 Calories"
    },
    "ingredients": [
        "12 ounces sliced bacon, cut crosswise into 1/2-inch pieces",
        "4 (5 ounce) balls prepared pizza dough",
        "1 large yellow onion, sliced",
        "1 cup fromage blanc (French-style fresh cheese)",
        "¼ cup creme fraiche",
        "1 pinch ground nutmeg",
        "salt and freshly ground black pepper to taste",
        "1 pinch cayenne pepper"
    ],
    "method": [
        "Step 1: Place bacon in a skillet and cook over medium-high heat until cooked but not crisp and fat has rendered out, about 8 minutes. Drain in a strainer; reserve fat.",
        "Step 2: Place skillet back over medium heat. Add sliced onions. Cook briefly just until they lose their raw edge and soften up slightly, 3 to 5 minutes. Add a teaspoon or 2 of bacon fat if the pan seems too dry. Remove the skillet from heat and allow to cool to room temperature.",
        "Step 3: Mix fromage blanc, crème fraîche, nutmeg, salt, black pepper, and cayenne pepper together in a mixing bowl.",
        "Step 4: Place 1 ball of pizza dough on a well-floured surface. Flatten and roll out to a 10- or 12-inch thin circle. Transfer to a cold cast iron pan. Heat over medium-high heat to precook the bottom of crust. As dough heats and bubbles appear, deflate them with the tines of a fork, so crust ends up thin and crisp (not chewy). When bottom is nicely browned and just about to start getting charred, 5 to 7 minutes, remove from heat. Repeat with remaining dough.",
        "Step 5: Spread a generous amount of cheese mixture over crust. Top evenly with some onions and bacon. Broil 5 or 6 minutes until edges are browned and starting to lift. Repeat for remaining tartes."
    ],
    "image": "images/tarte-flambé-alsatian-bacon-and-onion-tart.jpg"
}