{
    "title": "The Best Ever Vegan Sushi",
    "file_name": "the-best-ever-vegan-sushi",
    "url": "https://www.allrecipes.com/recipe/261714/the-best-ever-vegan-sushi/",
    "cuisine": "Japanese",
    "difficulty": "Medium",
    "cooking_time": "40 minutes",
    "country": "Japan",
    "continent": "Asia",
    "metadata": {
        "prep_time": "45 mins",
        "cook_time": "40 mins",
        "total_time": "1 hr 40 mins",
        "active_time": "Unknown",
        "servings": "6",
        "calories": "299 Calories"
    },
    "ingredients": [
        "1 cup short-grain sushi rice",
        "2 cups water",
        "1 pinch salt",
        "1 ½ teaspoons vegetable oil",
        "¼ cup rice vinegar",
        "2 tablespoons white sugar",
        "⅛ teaspoon salt",
        "1 (16 ounce) package extra-firm tofu",
        "1 tablespoon olive oil, or more as needed",
        "¼ small onion, minced (Optional)",
        "1 teaspoon garlic, minced (Optional)",
        "¼ cup vegan mayonnaise (such as Follow Your Heart Vegenaise)",
        "2 tablespoons Sriracha sauce, or to taste",
        "2 sheets nori, or as needed",
        "½ medium avocado - peeled, pitted, and sliced",
        "½ cup matchstick-sliced Savoy cabbage",
        "¼ cup matchstick-cut carrots",
        "¼ cup matchstick-cut seeded cucumber"
    ],
    "method": [
        "Step 1: Combine rice, water, and a pinch of salt in a saucepan; bring to a boil. Stir once with a bamboo rice spatula or a thin wooden spoon. Reduce the heat to low, cover, and cook until all water is absorbed and rice is tender, about 20 minutes. Let cool.",
        "Step 2: Heat vegetable oil in a small saucepan over medium heat; add rice vinegar, sugar, and 1/8 teaspoon salt. Heat mixture until all sugar has dissolved and liquid begins to simmer. Remove from the heat and let cool until safe to handle, at least 10 minutes. Fold small portions of the cooled liquid slowly into the cooled rice until mixture is slightly wet and sticky but not gooey; you may not need all of the liquid.",
        "Step 3: Press excess liquid out of the tofu using a paper towel. Cut tofu into strips.",
        "Step 4: Heat olive oil in a small skillet over medium heat. Add tofu strips, onion, and garlic; cook and stir until tofu is golden brown, about 4 minutes per side.",
        "Step 5: Mix vegan mayonnaise and Sriracha together in a small bowl.",
        "Step 6: Lay a sheet of nori, rough-side up, on a sushi mat. With wet fingers, firmly pat a thick, even layer of prepared rice over the nori, covering it completely. Arrange tofu strips, avocado, cabbage, carrots, and cucumber in a line along the bottom edge of the sheet.",
        "Step 7: Roll nori and sushi mat over the filling. Remove the mat and wrap the roll with plastic wrap, twisting ends tightly to compress the roll. Refrigerate until set, 5 to 10 minutes. Repeat with remaining nori and filling.",
        "Step 8: Remove sushi roll from the plastic wrap, slice into pieces, and top with the Sriracha mayonnaise.",
        "Step 9: Jasmine rice can be substituted for the sushi rice if desired.",
        "Step 10: Fried tofu offers a satisfying crunch similar to shrimp tempura, whereas pan-seared tofu is a bit more creamy. For fried tofu, you'll want the driest kind you can find, such as the pre-marinated kind sold in a vacuum-sealed package (instead of in liquid). Pat the tofu dry with a paper towel, slice it into 1/4-inch strips, and dust them with cornstarch. Heat a few tablespoons of vegetable oil in a skillet and fry the tofu until golden brown, 1 to 2 minutes per side."
    ],
    "image": "images/the-best-ever-vegan-sushi.jpg"
}