{
    "title": "Tonkatsu (Japanese-Style Crispy Fried Pork Cutlets)",
    "file_name": "tonkatsu-japanese-style-crispy-fried-pork-cutlets",
    "url": "https://www.allrecipes.com/recipe/260848/tonkatsu-japanese-style-crispy-fried-pork-cutlets/",
    "cuisine": "Japanese",
    "difficulty": "Medium",
    "cooking_time": "40 minutes",
    "country": "Japan",
    "continent": "Asia",
    "metadata": {
        "prep_time": "20 mins",
        "cook_time": "4 mins",
        "total_time": "24 mins",
        "active_time": "Unknown",
        "servings": "4",
        "calories": "322 Calories"
    },
    "ingredients": [
        "2  boneless pork chops, trimmed of excess fat",
        "½ teaspoon salt",
        "¼ teaspoon ground black pepper",
        "1  egg",
        "½ teaspoon soy sauce",
        "¼ cup all-purpose flour",
        "½ cup panko bread crumbs",
        "oil for frying"
    ],
    "method": [
        "Step 1: Place pork chops on a paper towel to absorb any excess moisture. Sprinkle with salt and pepper.",
        "Step 2: Whisk egg and soy sauce together in a small bowl.",
        "Step 3: Place flour on a small plate and panko in another. Dredge a pork chop in the flour, pressing it in using your fingertips to cover all crevices along the surface. Turn to evenly coat all sides.",
        "Step 4: Dip the pork into the egg mixture, coating completely. Transfer immediately to the bowl of panko, pressing in to evenly coat. Repeat process with the second pork chop.",
        "Step 5: Heat oil in a wide pan or wok on medium-high heat to 350 degrees F (175 degrees C). Lower a pork chop into the oil. Fry until bottom side is golden, 2 to 3 minutes. Turn; cook until other side turns golden and pork is slightly pink in the center, 2 to 3 minutes more. An instant-read thermometer inserted into the center should read at least 145 degrees F (63 degrees C). Pick up the cutlet and hold it on its side for a few seconds to let the oil drip off. Drain on a paper towel. Repeat with the second pork chop.",
        "Step 6: Panko is a Japanese-style large bread crumb that is found in most grocery stores."
    ],
    "image": "images/tonkatsu-japanese-style-crispy-fried-pork-cutlets.jpg"
}