{
    "title": "Tsukune (Japanese Chicken Meatballs)",
    "file_name": "tsukune-japanese-chicken-meatballs",
    "url": "https://www.allrecipes.com/recipe/254234/tsukune-japanese-chicken-meatballs/",
    "cuisine": "Japanese",
    "difficulty": "Medium",
    "cooking_time": "35 minutes",
    "country": "Japan",
    "continent": "Asia",
    "metadata": {
        "prep_time": "30 mins",
        "cook_time": "12 mins",
        "total_time": "42 mins",
        "active_time": "Unknown",
        "servings": "8",
        "calories": "133 Calories"
    },
    "ingredients": [
        "1 teaspoon vegetable oil",
        "1 teaspoon minced ginger",
        "1 teaspoon minced garlic",
        "¼ cup tamari",
        "¼ cup cooking sake",
        "¼ cup mirin",
        "2 tablespoons brown sugar",
        "1 teaspoon sesame seeds",
        "10 ½ ounces ground chicken",
        "1 large egg",
        "3  green onions, chopped",
        "½  carrot, grated",
        "¼ cup panko bread crumbs, or to taste",
        "2 tablespoons red miso paste, or more to taste",
        "2 tablespoons grated ginger",
        "1 tablespoon potato starch",
        "1 tablespoon crumbled seaweed",
        "1 tablespoon tamari, or more to taste",
        "1 tablespoon cooking sake, or more to taste",
        "1 teaspoon soy sauce",
        "1 teaspoon white sugar, or more to taste",
        "1 teaspoon paprika, or more to taste"
    ],
    "method": [
        "Step 1: Heat oil in a small pot over low heat. Add 1 teaspoon ginger and garlic. Cook and stir until slightly browned, about 2 minutes. Stir in 1/4 cup tamari, 1/4 cup sake, mirin, brown sugar, and sesame seeds. Simmer until glaze is slightly thickened, about 5 minutes.",
        "Step 2: Combine ground chicken, egg, green onions, carrot, bread crumbs, miso, 2 tablespoons ginger, potato starch, seaweed, 1 tablespoon tamari, 1 tablespoon sake, soy sauce, white sugar, and paprika in a large bowl. Mix into a thick paste, about 5 minutes.",
        "Step 3: Preheat a grill for medium heat and lightly oil the grate.",
        "Step 4: Roll ground chicken mixture into balls the size of your palm. Flatten them slightly into patties. Grill until well-browned, 3 to 4 minutes. Flip and continue grilling until browned on the second side, 2 to 3 minutes. An instant-read thermometer inserted into the center should read 165 degrees F (74 degrees C).",
        "Step 5: Brush glaze over meatballs before serving.",
        "Step 6: Substitute dark soy sauce for the tamari in the sauce if desired. Replace the brown sugar with white sugar if desired. Add potato or cornstarch to the glaze to thicken it if you like.",
        "Step 7: Substitute red pepper flakes for the paprika if preferred.",
        "Step 8: Refrigerate the meatball mixture for 2 hours to allow it to thicken if you like.",
        "Step 9: Cook in a grill pan or skillet instead of grilling outdoors if preferred."
    ],
    "image": "images/tsukune-japanese-chicken-meatballs.jpg"
}