{
    "title": "Turon (Caramelized Banana Triangles)",
    "file_name": "turon-caramelized-banana-triangles",
    "url": "https://www.allrecipes.com/recipe/262424/turon-caramelized-banana-triangles/",
    "cuisine": "Filipino",
    "difficulty": "Easy",
    "cooking_time": "30 minutes",
    "country": "Philippines",
    "continent": "Asia",
    "metadata": {
        "prep_time": "30 mins",
        "cook_time": "15 mins",
        "total_time": "45 mins",
        "active_time": "Unknown",
        "servings": "15",
        "calories": "67 Calories"
    },
    "ingredients": [
        "1 tablespoon butter",
        "1  banana, halved lengthwise",
        "¼ cup brown sugar",
        "1 dash ground cinnamon",
        "1 tablespoon water",
        "1 tablespoon all-purpose flour",
        "1 tablespoon white sugar",
        "¼ teaspoon ground cinnamon",
        "5  lumpia wrappers, cut into thirds, or more as needed",
        "vegetable oil for frying"
    ],
    "method": [
        "Step 1: Melt butter in a skillet over medium-high heat. Stir in brown sugar and 1 dash of cinnamon. Mix well until bubbles start to appear. Add banana; cook, stirring gently, until it starts to brown, about 5 minutes. Transfer banana to a bowl; roughly slice into 1/4-inch chunks using a spoon. Let filling cool briefly.",
        "Step 2: Whisk water and flour together in a small bowl to make the paste. Mix white sugar and 1/4 teaspoon cinnamon together in another small bowl.",
        "Step 3: Lay 1 lumpia strip on a flat work surface. Place 3/4- to 1 teaspoon of filling in the lower corner of the wrapper; fold 1 corner over the filling and enclose, forming a triangle. Fold over the other edges to finish the triangle, smearing the last fold with the paste to seal. Place triangle on a plate, seam-side down. Repeat with remaining wrappers, filling, and paste.",
        "Step 4: Heat 2 inches of oil in a skillet over medium-high heat. Fry the triangles in batches until golden brown, about 4 minutes per batch. Drain on a paper towel and sprinkle cinnamon sugar over the warm triangles.",
        "Step 5: The spring roll (lumpia) wrappers I use are 8x8 inches in size and 20 ounces is 25 pieces. You can freeze the leftover wrappers. When you are ready to use, just defrost in the fridge or on the counter.",
        "Step 6: We have determined the nutritional value of oil for frying based on a retention value of 10% after cooking. Amount will vary depending on cooking time and temperature, ingredient density, and specific type of oil used."
    ],
    "image": "images/turon-caramelized-banana-triangles.jpg"
}