{
    "title": "Vegan Homemade Pop-Tarts",
    "file_name": "vegan-homemade-pop-tarts",
    "url": "https://www.allrecipes.com/recipe/281431/vegan-homemade-pop-tarts/",
    "cuisine": "American",
    "difficulty": "Medium",
    "cooking_time": "40 minutes",
    "country": "United States",
    "continent": "North America",
    "metadata": {
        "prep_time": "30 mins",
        "cook_time": "15 mins",
        "total_time": "1 hr 45 mins",
        "active_time": "Unknown",
        "servings": "6",
        "calories": "724 Calories"
    },
    "ingredients": [
        "1 cup vegetable shortening",
        "3 cups all-purpose flour",
        "2 teaspoons white sugar",
        "½ teaspoon salt",
        "½ cup ice water",
        "¾ cup strawberry jam",
        "1 cup powdered sugar",
        "2 tablespoons almond milk",
        "1 drop red food coloring, or as needed"
    ],
    "method": [
        "Step 1: Scoop tablespoons of shortening onto a plate and chill in the freezer for 10 minutes.",
        "Step 2: Meanwhile, combine flour, sugar, and salt in a bowl and chill for 5 to 10 minutes.",
        "Step 3: Crumble shortening into the flour mixture with your fingers until no large clumps remain. Add 1/2 cup ice water to the mixture, a little at a time, until dough reaches a shaggy consistency. Knead on the countertop a couple of times to combine. The dough should appear a little too dry.",
        "Step 4: Place dough back into the bowl or a large container and cover with a lid. Refrigerate for 30 minutes.",
        "Step 5: Preheat the oven to 350 degrees F (175 degrees C).",
        "Step 6: Roll dough into a large rectangle, about 1/8-inch thick. Cut into twelve 4x6-inch rectangles.",
        "Step 7: Place about 1 1/2 tablespoon of strawberry jam in the center of 6 of the rectangles. Brush the edges with water and top with the other dough halves. Seal the edges of each tart with a fork. Trim the edges for neater tarts, if desired.",
        "Step 8: Bake in the preheated oven until the edges are lightly browned, 15 to 25 minutes. Let cool, 20 to 30 minutes.",
        "Step 9: Combine powdered sugar, almond milk, and food coloring in a bowl for icing. Drizzle icing over the cooled tarts.",
        "Step 10: You can use vegan butter instead of shortening. If so, cut butter into cubes and chill on a plate in the freezer for 5 minutes before using.",
        "Step 11: You can use any kind of jam you like.",
        "Step 12: Mine were about 4 inches wide and 6 inches long, but exact measurements don't really matter."
    ],
    "image": "images/vegan-homemade-pop-tarts.jpg"
}