{
    "title": "Vietnamese Noodle Salad with Lemongrass Chicken",
    "file_name": "vietnamese-noodle-salad-with-lemongrass-chicken",
    "url": "https://www.allrecipes.com/recipe/271117/vietnamese-noodle-salad-with-lemongrass-chicken/",
    "cuisine": "Vietnamese",
    "difficulty": "Medium",
    "cooking_time": "30 minutes",
    "country": "Vietnam",
    "continent": "Asia",
    "metadata": {
        "prep_time": "20 mins",
        "cook_time": "10 mins",
        "total_time": "4 hrs 15 mins",
        "active_time": "Unknown",
        "servings": "4",
        "calories": "517 Calories"
    },
    "ingredients": [
        "4 small skinless, boneless chicken breast halves",
        "3  red chile peppers, stemmed",
        "3 cloves garlic",
        "2 stalks lemongrass, white parts only, finely sliced",
        "4 tablespoons olive oil",
        "2 tablespoons fish sauce",
        "2 teaspoons sesame oil",
        "2 teaspoons white sugar",
        "1 teaspoon flaked sea salt",
        "2 tablespoons white sugar",
        "1 medium lemon, juiced",
        "4 tablespoons water, or more as needed",
        "2 tablespoons fish sauce",
        "1 clove garlic, finely chopped",
        "1  red chile pepper, finely chopped",
        "1 (8 ounce) package vermicelli rice noodles",
        "½ cup baby lettuce, or to taste",
        "½ cup julienned cucumber, or to taste",
        "½ cup finely shredded carrot, or to taste",
        "1 tablespoon finely chopped fresh cilantro, or to taste",
        "1 tablespoon finely chopped fresh mint, or to taste"
    ],
    "method": [
        "Step 1: Place chicken into a large zip-top freezer bag.",
        "Step 2: Combine red chile peppers, garlic, lemongrass, olive oil, fish sauce, sesame oil, sugar, and sea salt in a food processor. Blend until finely chopped and combined. Pour marinade into the freezer bag , making sure chicken is well coated. Marinate in the refrigerator for at least 3 hours, or up to overnight.",
        "Step 3: Remove chicken from the refrigerator 30 minutes before cooking to allow to come to room temperature.",
        "Step 4: Heat a large cast iron or nonstick pan over medium-high heat. Cook chicken in batches until golden and caramelized on the outside and no longer pink in the centers, 7 to 10 minutes. Transfer chicken to a cutting board and cut into thick slices using a sharp knife.",
        "Step 5: Place sugar in a medium bowl. Add lemon juice and stir to dissolve. Stir in water and fish sauce, followed by garlic and chile pepper. Allow flavors to settle, 5 to 10 minutes. Taste and adjust for seasoning; add more lemon juice or sugar as needed.",
        "Step 6: Meanwhile, place noodles in a large bowl and cover with hot water. Set aside until noodles are softened, about 15 minutes.",
        "Step 7: Place cooked noodles into serving bowls. Top with chicken, lettuce, cucumber, carrot, cilantro, mint, and sauce.",
        "Step 8: Cook noodles according to individual package instructions.",
        "Step 9: Nutrition data for this recipe includes the full amount of marinade ingredients. The actual amount of marinade consumed will vary."
    ],
    "image": "images/vietnamese-noodle-salad-with-lemongrass-chicken.jpg"
}