{
    "title": "Yaki Udon",
    "file_name": "yaki-udon",
    "url": "https://www.allrecipes.com/recipe/8539106/yaki-udon/",
    "cuisine": "Japanese",
    "difficulty": "Easy",
    "cooking_time": "25 minutes",
    "country": "Japan",
    "continent": "Asia",
    "metadata": {
        "prep_time": "Unknown",
        "cook_time": "15 mins",
        "total_time": "35 mins",
        "active_time": "20 mins",
        "servings": "4",
        "calories": "212 Calories"
    },
    "ingredients": [
        "¼ cup oyster sauce",
        "3 tablespoons soy sauce",
        "2 tablespoons mirin",
        "1 tablespoon unseasoned rice vinegar",
        "2 teaspoons Worcestershire sauce",
        "2 teaspoons toasted sesame oil",
        "1 teaspoon packed light brown sugar",
        "1 teaspoon Sriracha sauce",
        "1 medium garlic, grated",
        "1 medium (5-oz.) bunch scallions",
        "2 tablespoons canola oil",
        "12 ounces sliced mixed wild mushrooms (such as cremini, oyster, and shiitake) (about 6 cups)",
        "2 medium heads baby bok choy, thinly sliced",
        "1 (10 ounce) package carrots, cut into match-stick size pieces",
        "½ cup water, divided",
        "1 (14 ounce) package pre-cooked udon noodles (such as KA-ME)",
        "Optional garnishes: thinly sliced nori, cilantro, lime wedges, furikake seasoning"
    ],
    "method": [
        "Step 1: Whisk together oyster sauce, soy sauce, mirin, rice vinegar, Worcestershire, sesame oil, sugar, Sriracha, and garlic in a small bowl; set aside. Remove root ends from scallions and discard. Chop whites and light greens into 2-inch pieces and quarter pieces lengthwise; set aside. Thinly slice remaining dark greens of scallions and reserve for garnish.",
        "Step 2: Heat oil in a large skillet or wok over medium-high heat. Add mushrooms in a single layer and cook, undisturbed, until browned on first side, about 3 minutes. Stir and continue to cook, stirring occasionally, until mushrooms are tender and golden brown on both sides, about 4 more minutes. Add bok choy, carrots, sliced whites and light greens of scallions, and 1/4 cup water to pan with mushrooms. Cook, stirring occasionally, until vegetables are just tender, about 3 minutes.",
        "Step 3: Add udon noodles and remaining 1/4 cup water and cook, gently separating noodles with tongs or spoon. Add reserved oyster sauce mixture and cook, stirring constantly, until noodles and vegetables are well-coated, about 1 minute. Divide among serving bowls and garnish with reserved sliced greens of scallions and optional garnishes. Serve immediately.",
        "Step 4: Recipe developed by Marianne Williams"
    ],
    "image": "images/yaki-udon.jpg"
}